<?php defined('BASEPATH') or exit('No direct script access allowed');

$lang['contact_submit_error']  = 'Συγνώμη. Φαίνεται ότι μπορεί να είσαστε ένα bot. Παρακαλούμε αποδεχτείτε την συγνώμη μας αν κάνουμε λάθος και ελάτε σε επικοινωνία μαζί μας με κάποιον άλλον τρόπο.';
$lang['contact_sent_text']     = 'Το μήνυμα σας εστάλη. Θα έρθουμε σε επικοινωνία μαζί σας όσο πιο σύντομα γίνεται.';
$lang['contact_error_message'] = 'Υπήρξε ένα πρόβλημα κατά την αποστολή αυτού του μηνύματος. Προσπαθήστε ξανά αργότερα.';