<?php defined('BASEPATH') OR exit('No direct script access allowed');

// labels
$lang['header']			=	'चरण ३: अनुमतिया सेट करे';
$lang['intro_text']		= 	'पायरोसीएम्एस इंस्टाल करने से पहले, आपको फाइल्स और फ़ोल्डर्स लिखने-अनुरूप है यह जाँच ले, वह फाइल्स और फ़ोल्डर्स निचे सूचीबद्ध किये गए है. किसी भी सब-फोल्डर को उचित अनुमति है यह सुनिश्चित कर लें.';

$lang['folder_perm']	= 'फोल्डर अनुमतियाँ';
$lang['folder_text']	= 'दिए गए फ़ोल्डर्स के सीएचएम्ओडी मान ७७७ में परिवर्तित करने चाहिए. (कुछ जगहों पर ७५५ भी काम करता है)';

$lang['file_perm']		= 'फ़ाइल अनुमतियाँ';
$lang['file_text']		= 'दी गईं फाइल्स की अनुमतियाँ ६६६ में परिवर्तित करनी चाहिए. डेटाबेस फ़ाइल की अनुमतियाँ इंस्टालेशन के पूर्व परिवर्तित करना आवश्यक है.';

$lang['writable']		= 'लिखने-अनुरूप';
$lang['not_writable']		= 'लिखने-अनुरूप नहीं';

$lang['show_commands']		= 'आदेशों को दिखाएँ';
$lang['hide_commands']		= 'आदेशों को छुपाएँ';

$lang['next_step']		= 'अगले चरण के ओर बढे';
$lang['step4']			= 'चरण ४';
$lang['retry']			= 'पुनः प्रयास करे';

/* End of file step_3_lang.php */