<?php defined('BASEPATH') OR exit('No direct script access allowed');

// labels
$lang['header']			=	'चरण २: आवश्यकताएं जांचे';
$lang['intro_text']		= 	'इनस्टॉलेशन का दूसरा चरण यह जानने के लिए है के आपका सर्वर पायरोसीएम्एस को समर्थन करता है. अधिकतम सर्वर बिना किसी परेशानी के इसे चलने में सक्षम होते है.';
$lang['mandatory']		= 	'अनिवार्य';
$lang['recommended']	= 	'सिफारिश योग्य';

$lang['server_settings']= 	'एचटीटीपी सर्वर सेटिंग्स';
$lang['server_version']	=	'आपका सर्वर सोफ्टवेअर:';
$lang['server_fail']	=	'आपका सर्वर सोफ्टवेअर समर्थित नहीं है, इसीलिए पायरोसीएम्एस चल या नहीं भी चल सकता है. जबतक आपके पीएचपी और मायएसक्यूएल इनस्टॉलेशन्स अद्यतन है, पायरोसीएम्एस को सही ढंग से काम करना चाहिए, बिना किसी युआरएल गडबडी के.';

$lang['php_settings']	=	'पीएचपी सेटिंग्स';
$lang['php_required']	=	'पायरोसीएम्एस को पीएचपी के संस्करण %s या अधिक की जरुरत है.';
$lang['php_version']	=	'आपका पीएचपी सर्वर अभी जो संस्करण इस्तेमाल कर रहा है वो है';
$lang['php_fail']		=	'आपका पीएचपी संस्करण समर्थित नहीं है. पायरोसीएम्एस को पीएचपी के %s या अधिक संस्करण की जरुरत है';

$lang['mysql_settings']	=	'मायएसक्यूएल सेटिंग्स';
$lang['mysql_required']	=	'पायरोसीएम्एस को मायएसक्यूएल के संस्करण ५.० या अधिक की आवश्यकता है.';
$lang['mysql_version1']	=	'आपका सर्वर अभी इस्तेमाल कर रहा है';
$lang['mysql_version2']	=	'आपका क्लायंट अभी इस्तेमाल कर रहा है';
$lang['mysql_fail']		=	'आपका मायएसक्यूएल का संस्करण समर्थित नहीं है. पायरोसीएम्एस को सरलतासे चलने के लिए मायएसक्यूएल के संस्करण ५.० या अधिक की आवश्यकता है.';

$lang['gd_settings']	=	'जीडी सेटिंग्स';
$lang['gd_required']	= 	'पायरोसीएम्एस को इमेजेस के कुशलतापूर्वक प्रयोग के लिए जीडी लायब्ररी संस्करण १.० या अधिक की आवश्यकता है.';
$lang['gd_version']		= 	'आपका सर्वर अभी जो संस्करण इस्तेमाल कर रहा है वो है';
$lang['gd_fail']		=	'हम जीडी लायब्ररी का संस्करण तय नहीं कर पा रहे है. इसका मतलब है जीडी लायब्ररी इंस्टाल नहीं है. पायरोसीएम्एस फिर भी कम करेगा, किन्तु इमेजेस से जुड़े फंक्शन ठीक से काम नहीं कर पाएंगे. जीडी लायब्ररी को समर्थ करने की अत्यधिक सिफारिश की जाती है.';

$lang['summary']		=	'सारांश';

$lang['zlib']			=	'झेडलिब';
$lang['zlib_required']	= 	'पायरोसीएम्एस को थीम्स इंस्टाल और अनइंस्टाल करने हेतु झेडलिब की आवश्यकता है.';
$lang['zlib_fail']		=	'झेडलिब मिल नहीं पा रही है. अक्सर इसका मतलब होता है के झेडलिब इंस्टाल नहीं है. पायरोसीएम्एस फिर भी ठीक से काम करेगा, किन्तु थीम्स के इंस्टालेशन काम नहीं करेंगे. झेडलिब को समर्थ करने की अत्यधिक सिफारिश की जाती है.';

$lang['curl']			=	'कर्ल';
$lang['curl_required']	=	'पायरोसीएम्एस को दूसरे वेबसाइट्स से जुड़ने के लिए कर्ल की आवश्यकता है.';
$lang['curl_fail']		=	'झेडलिब मिल नहीं पा रही है. अक्सर इसका मतलब होता है के कर्ल इंस्टाल नहीं है. पायरोसीएम्एस फिर भी ठीक से काम करेगा, किन्तु कुछ फंक्शन्स काम नहीं कर पाएँगे. कर्ल को समर्थ करने की अत्यधिक सिफारिश की जाती है.';

$lang['summary_success']	=	'आपका सर्वर पायरोसीएम्एस को सही ढंग से काम करने के लिए सभी आवश्यकताओं की पूर्ति करता है, निचे डी गयी बटन पर क्लीक करके अगले चरण में जाएँ.';
$lang['summary_partial']	=	'आपका सर्वर पायरोसीएम्एस की <em>अधिकतम</em> आवश्यकताओं की पूर्ति करता है. पायरोसीएम्एस सही ढंग से काम करना चाहिए किन्तु संभावना है की आप कुछ चीजों में जैसे की इमेजेस का आकार बदलते वक्त या थम्बनेल बनाते वक्त दिक्कत जा सकती है.';
$lang['summary_failure']	=	'ऐसा प्रतीत होता है के आपका सर्वर पायरोसीएम्एस की आवश्यकताओं को पूरा करने में असमर्थ है. कृपया अपने सर्वर एडमिनिस्ट्रेटर या होस्टिंग कंपनी को इसका हल निकलने की सूचना दें.';
$lang['next_step']		=	'अगले चरण की तरफ बढे';
$lang['step3']			=	'चरण ३';
$lang['retry']			=	'पुनः प्रयास करें';

// messages
$lang['step1_failure']	=	'कृपया जरुरी डेटाबेस की जानकारी निचे दिए फॉर्म में भरें...';

/* End of file step_2_lang.php */