<?php if (!defined('BASEPATH')) exit('No direct script access allowed');

// labels
$lang['header']			=	'चरण ४: डेटाबेस बनाएँ';
$lang['intro_text']		=	'निचे दिया फॉर्म भरे और पायरोसीएम्एस को इंस्टाल करने के लिए "इंस्टाल" लिखे बटन को दबाएँ. यह सुनिश्चित कर लें की सही डेटाबेस का चुनाव किया है क्युकी सभी मौजूदा परिवर्तन मिट जाएँगे.';

$lang['db_settings']	=	'डेटाबेस सेटिंग्स';
$lang['db_create']		=	'डेटाबेस बनाएँ';
$lang['db_notice']		=	'आपको यह स्वयं करना होगा';
$lang['default_user']	=	'डिफॉल्ट प्रयोक्ता';
$lang['database']		=	'डेटाबेस';
$lang['site_settings']	= 	'साईट सेटिंग्स';
$lang['site_ref']		=	'साईट रेफरंस';
$lang['user_name']		= 	'प्रयोक्तानाम';
$lang['first_name']		= 	'पहला नाम';
$lang['last_name']		=	'अंतिम नाम';
$lang['email']			=	'इ-मेल';
$lang['password']		= 	'पासवर्ड';
$lang['conf_password']	=	'पासवर्ड की पुष्टि';
$lang['finish']			=	'इंस्टाल';

$lang['error_101']		=	'डेटाबेस मिल नहीं पा रहा. अगर आपने इंस्टॉलर को इसे बनाने के लिए कहा है, तो सही अनुमति न होने के कारण ये असफल हो सकता है.';
$lang['error_102']		=	'इंस्टॉलर डेटाबेस में टेबल्स नहीं बना पा रहा.';
$lang['error_103']		=	'इंस्टॉलर डेटाबेस में जानकारी नहीं डाल पा रहा.';
$lang['error_104']		=	'इंस्टॉलर डिफॉल्ट प्रयोक्ता नहीं बना पा रहा';
$lang['error_105']		=	'डेटाबेस कॉन्फ़िगरेशन फ़ाइल नहीं बना पा रहा, क्या आपने चरण ३ को छोड़ कर छल करने की कोशिश की है?';
$lang['error_106']		=	'कॉन्फिग फ़ाइल नहीं लिख पा रहे है, क्या आप निश्चित है के फ़ाइल के सही अनुमतियाँ सेट है?';
$lang['success']		=	'पायरोसीएम्एस सफलतापूर्वक इंस्टाल हो गया है.';

/* End of file step_4_lang.php */