<?php  if (!defined('BASEPATH')) exit('No direct script access allowed');

// labels
$lang['header']			=	'चरण १: डेटाबेस और सर्वर कन्फिगर करे.';
$lang['intro_text']		=	'डेटाबेस जाँचने से पहले, हम जानना चाहते है के वह कहा है और लॉगइन की जानकारियाँ क्या है.';

$lang['db_settings']	=	'डेटाबेस सेटिंग्स';
$lang['db_text']		=	'इंस्टॉलर को मायएसक्यूएल सर्वर का संस्करण समझने के लिए यह जरुरी है के आप होस्ट का नाम, प्रयोक्ता का नाम और पासवर्ड निचे दिए फॉर्म में लिखे. इन सेटिंग्स का प्रयोग डेटाबेस इंस्टाल करने के लिए भी किया जाएगा.';

$lang['server']			=	'सर्वर';
$lang['username']		=	'प्रयोक्ता का नाम';
$lang['password']		=	'पासवर्ड';
$lang['portnr']			=	'पोर्ट';
$lang['server_settings']=	'सर्वर सेटिंग्स';
$lang['httpserver']		=	'एचटीटीपी सर्वर';
$lang['rewrite_fail']	=	'आपने चुना है "(अपाची मोड_रिराइट के साथ)", किन्तु हम यह नहीं बता पा रहे है के आपके सर्वर पर मोड_रिराइट सक्रीय है या नहीं. आप अपने होस्ट से मोड_रिराइट की सक्रियता के बारे में पूछे या फिर अपने जोखिम पर इंस्टाल करे.';
$lang['mod_rewrite']	=	'आपने चुना है "(अपाचे मोड_रिराइट के साथ)", किन्तु यह प्रतीत हो रहा है के आपके सर्वर पर मोड_रिराइट सक्रीय नहीं है. अपने होस्ट से इसे इंस्टाल करेने को कहे या फिर पायरोसीएम्एस को "अपाची (मोड_रिराइट बिना)" विकल्प के साथ इंस्टाल करें.';
$lang['step2']			=	'चरण २';

// messages
$lang['db_success']		=	'डेटाबेस की सेटिंग्स को जाँचा गया और वें व्यवस्थित है.';
$lang['db_failure']		=	'डेटाबेस से जुड़ने में कठिनाइयाँ आ रही है: ';

/* End of file step_1_lang.php */