<?php defined('BASEPATH') or exit('No direct script access allowed');

// labels
$lang['header']		=	'مرحله چهارم: ایجاد ادمین'; #translate
$lang['intro_text']		=	'موارد خواسته شده در مورد ادمین سایت را نیز در زیر وارد کنید و دکمه ی نصب را کلیک کنید.';

$lang['default_user']	=	'کاربر اصلی';
$lang['database']		=	'پایگاه داده';
$lang['site_settings']	= 	'تنظیمات سایت';
$lang['site_ref']		=	'Site Ref';
$lang['user_name']		= 	'نام کاربری';
$lang['first_name']		= 	'نام';
$lang['last_name']		=	'نام خانوادگی';
$lang['email']			=	'ایمیل';
$lang['password']		= 	'پسورد';
$lang['conf_password']		=	'تاییدیه پسورد';
$lang['finish']			=	'نصب';

$lang['invalid_db_name'] = 'نام پایگاه داده که وارد کرده اید نامعتبر است لطفا از حروف انگلیسی کوچک استفاده نمایید.';
$lang['error_101']		=	'پایگاه داده مورد نظر یافت نشد اگر شما از  خواسته اید که ما پایگاه داده را ایجاد کنیم احتمالا به دلیل نداشتن اجازه کافی موفق به ایجاد آن نشده ایم.';
$lang['error_102']		=	'امکان اضافه کردن جدول های جدید در پایگاه داده میسر نیست.';
$lang['error_103']		=	'امکان اضافه کردن اطلاعات به جدول ها در پایگاه داده میسر نیست.';
$lang['error_104']		=	'نتوانستیم کاربر اصلی (ادمین) را در سایت ایجاد کنیم.';
$lang['error_105']		=	'فایل تنظیمات پایگاه داده قابل نوشتن نیست، مشکلی در مرحله سوم رخ داده است.';
$lang['error_106']		=	'فایل کانفیگ را نتوانستیم ایجاد کنیم آیا از اجازه های خود برای نوشتن اطلاعات بر روی سرو مطمئن هستید؟';
$lang['success']		=	'PyroCMS با موفقیت نصب شد.';