<?php defined('BASEPATH') or exit('No direct script access allowed');

// labels
$lang['header']		=	'مرحله اول : تنظیم پایگاه داده و سرور';
$lang['intro_text']		=	'پروسه نصب بسیار ساده است و طی چند دقیقه به پایان میرسد. چنانچه شما اطلاعات کافی ندارید می توانید از فراهم کننده هاستینگ خود کمک بگیرید و یا <a href="http://www.pyrocms.com/contact" target="_blank">با ما تماس بگیرید</a>';

$lang['db_settings']	=	'تنظیمات پایگاه داده ها';
$lang['db_text']		=	'PyroCMS نیاز به پایگاه داده (MySQL) برای ذخیره تمام محتوا و تنظیمات خود دارد، پس اولین کاری که ما انجام خواهیم داد، ایجاد یک اتصال به یک پایگاه داده موجود و یا ایجاد یک پایگاه جدید است، اگر شما متوجه نمی شوید که در اینجا چه چیزی از شما خواسته شده است از فراهم کننده هاستینگتان سوال بفرمایید.';
$lang['db_missing']	=	'درایور PHP برای اتصال به پایگاه داده بر روی سرور وجود ندارد لطفا با ادمین هاستینگ تماس بگیرید تا آن را نصب کند.';
$lang['db_create']	=	'ایجاد یک پایگاه داده ی جدید';
$lang['db_notice']	=	'احتمالا شما می باید این کار را توسط کنترل پنل هاستینگ خود انجام دهید.';
$lang['database']		=	'نام پایگاه داده ها';

$lang['server']		=	'نام هاست MySQL';
$lang['username']	=	'نام کاربری MySQL';
$lang['password']	=	'پسورد MySQL';
$lang['portnr']		=	'پورت MySQL';
$lang['server_settings']   =	'تنظیمات سرور';
$lang['httpserver']	=	'سرور HTTP';

$lang['httpserver_text']   =	'هنگامی که یک کاربر به سایت شما می آید PyroCMS نیاز به یک سرور HTTP دارد تا بتواند اطلاعات را به صورت پویا در اختیار کاربر قراردهد. همین که الان شما دارید این صفحه را مشاهده می کنید یعنی اینکه شما یک سرور HTTP دارید.  اما اگر شما دقیقا بدانید که سرور شما از چه نوعی است بسیار بهتر می توان آن را تنظیم کرد.  اگر نمی دانید که این ها چه معنایی می دهد از آن عبور کنید و فرایند را ادامه بدهید.';
$lang['rewrite_fail']	=	' شما "(Apache with mod_rewrite)" را انتخاب کرده اید اما ما نمی توانیم به شما بگوییم که آیا این مورد روی سرور شما فعال شده است یا خیر لطفا از مدیر سایت سوال بفرمایید یا می توانید با ریسک خودتان فرآیند را ادامه بدهید.';
$lang['mod_rewrite']	=	' شما "(Apache with mod_rewrite)" را انتخاب کرده اید اما این مورد روی سرور شما فعال نشده است لطفا از مدیر سایت بخواهید این مورد را فعال کند و یا "(Apache without mod_rewrite)" را انتخاب نمایید.';
$lang['step2']		=	'مرحله دوم';

// messages
$lang['db_success']	=	'تنظیمات پایگاه داده تست شد و همه چیز رو به راه است';
$lang['db_failure']	=	'برای ارتباط با پایگاه داده و یا ایجاد دیتابیس جدید خطایی رخ داده است: ';

/* End of file step_1_lang.php */
