<?php defined('BASEPATH') or exit('No direct script access allowed');

// labels
$lang['header']		='مرحله دوم: چک کردن نیازمندیها';
$lang['intro_text']		= 'در مرحله ی دوم بررسی می شود که آیا سرور شما حداقل های لازم برای نصب PyroCMS را داراست یا خیر. اغلب سرور ها این نیازمندیها ها را دارا هستند.';
$lang['mandatory']	= 'اجباری';
$lang['recommended']	= 'توصیه شده';

$lang['server_settings']   = 	'تنظیمات سرور HTTp';
$lang['server_version']	=	'نرم افزار سرور شما:';
$lang['server_fail']	=	'نرم افزار سرور شما نمی تواند PyroCMS را نصب کند، البته ممکن است نصب بشود و یا ممکن است نشود. تازمانی که PHP  و MYSQL شما به روز باشند احتمالا نرم افزار نصب خواهد شد اما بدون لینک های تمیز شده.';

$lang['php_settings']	=	'تنظیمات PHP';
$lang['php_required']	=	' برای نصب PyroCMS  به PHP  با ورژن %s یا بالاتر نیاز است.';
$lang['php_version']	=	'ورژن کنونی سرور شما';
$lang['php_fail']		=	'ورژن PHP روس سرور شما پشتیبانی نمی شود باید %s یا بیشتر باشد.';

$lang['mysql_settings']	=	'تنظیمات MySQL';
$lang['mysql_required']	=	'ورژن MySQL شما باید 5 یا بیشتر باشد.';
$lang['mysql_version1']	=	'ورژن کنونی:';
$lang['mysql_version2']	=	'ورژن کنونی کلاینت شما:';
$lang['mysql_fail']	=	'ورژن MySQL می باید 5 یا بیشتر باشد..';

$lang['gd_settings']	=	'تنظیمات GD';
$lang['gd_required']	= 	'برای مدیریت تصاویر ما نیاز به کتابخانه ی GD نسخه ی 1 و یا بالاتر داریم.';
$lang['gd_version']	= 	'نسخه ای که روی سرور شما نصب شده است';
$lang['gd_fail']		=	'ورژن کتابخانه GD شما را نتوانستیم پیدا کنیم معمولا به این معناست که این کتابخانه نصب نشده است، می توانید نصب را ادامه دهید اما ممکن اس در کارکرد تصاویر سایت مشکلاتی را مشاهده نمایید.';

$lang['summary']		=	'خلاصه وضعیا';

$lang['zlib']		=	'Zlib';
$lang['zlib_required']	= 	'برای آنزیپ کردن و نصب قالب ها نیاز به این کتابخانه است.';
$lang['zlib_fail']		=	'کتابخانه ZLib روی سرور شما یافت نشد اگر چه می توانید نصب را ادامه بدهید اما برخی موارد کار نخواهد کرد و توصیه می شود این کتابخانه را نصب کنید.';

$lang['curl']		=	'Curl';
$lang['curl_required']	=	'جهت اتصال به سایت های دیگر از کتابخانه ی Curl استفاده خواهد شد';
$lang['curl_fail']		=	'کتابخانه ی Curl را برای روی سرور پیدا نکردیم، ممکن است نصب را ادامه بدهید و مشکلی نداشته باشد اما برخی موارد در سایت کار نخواهد کرد لذا توصیه می کنیم این کتابخانه را فعال کنید.';

$lang['summary_success']	=	'همه ی شرایط محیای نصب است برای ادامه بر روی دکمه ی زیر کلیک نمایید.';
$lang['summary_partial']	=	'سرور شما تقریبا همه ی شرایط اولیه را داراست، فرآیند نصب انجام خواهد شد اگر چه ممکن است در برخی موارد مثلا عکس ها و غیره با مشکلاتی مواجه شوید.';
$lang['summary_failure']	=	'سرور شما شرایط حداقلی برای ادامه فرآیند را دارا نیست لطفا با مسئول هاستینگ خود مسئله را مطرح نمایید.';
$lang['next_step']	=	'برو به مرحله بعد';
$lang['step3']		=	'مرحله سوم';
$lang['retry']		=	'تلاش مجدد';

// messages
$lang['step1_failure']	=	'لطفا تنظیمات پایگاه داده را وارد نمایید';