<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h6>کلیات</h6><hr>
<p>ماژول فایلها یک ابزار بسیار مناسب برای ادمین ها است تا بتوانند فایل ها چند رسانه ای رادر سایت مدیریت کنند
همه ی فایل ها و تصاویری که در صفحات مختلف به کار گرفته می شوند اینجا ذخیره می شوند
برای استفاده تصاویر در صفحات می توانید با استفاده از دکمه ی مربوطه در ویرایشگر WYSIWYG آنها را در صفحه قرار دهید.</p>
<p>ماژول فایل ها بسیار شبیه کامپیوتر های شخصی کار می کند و میتوانید با راست کلیک کردن بر روی صفحه به عملیات های مختلف بپردازید</p>

<h6>مدیریت پوشه ها</h6>
<p>
پس از ایجاد پوشه یا فولدر اصلی شما می توانید هر تعدادی که نیاز دارید زیرپوشه ایجاد کنید و از آنها برای منظم کردن فایل های مربوط به وبلاگ و دیگر بخش ها استفاده نمایید.
نام پوشه ها فقط جهت استفاده ی شما هستند و این نام ها در سایت نمایش داده نمی شوند.
برای مدیریت پوشه می توانید روی آن کلیک راست کرده و از گزینه های پیش رو انتخاب نمایید .
</p>
<p>
اگر از تامین کننده های خدمات ابری استفاده می کنید می توانید محل آنها را با راست کلیک کردن بر روی فولدر وارد کنید
</p>

<h6>مدیریت فایل ها </h6>
<p>
برای مدیریت فایل ها به پوشه ی مورد نظر بروید و با راست کلیک کردن بر روی آنها می توانید عملیات مختلفی را بر روی فایل انجام دهید.
همچنین می توانید فایل ها را بکشید و در محل دیگری رها کنید تا محل آن عوض شود.
</p>

<h6>آپلود کردن فایل ها </h6>
<p>
بعد از اینکه در فولدر مورد نظر کلیک راست کردید می توانید با انتخاب گزینه ی آپلود  فایل ها را آپلود کنید.
می توایند یک فایل و یا همزمان چندین فایل را آپلود نمایید و مشکلی وجود ندارد.
</p>

<h6>همزمانسازی فایل ها </h6>
<p>
اگر از تکنولوژی ابری برای ذخیره سازی فایل هایتان استفاده می کنید می توانید فایل هایی که در پنل مدیریت می بینید را با سرور ابری خود همزمانسازی کنید.
</p>

<h6>جستجو</h6>
<p>
شما می توانید تمام فایل ها و فولدر های خود را جستجو کنید 
پنج فولدر و فایل اولی که با جستجوی شما جور باشند نمایش داده می شوند.</p>";