<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h4>کلیات</h4>
<p>ماژول نظرات به کاربران و مهمان های سایت اجازه می دهد تا بتوانند نظرات خود را در مورد محتوای سایت ابراز کنند</p>

<h4>فعال کردن کامنت ها</h4><hr>
<p>کامنت ها بر روی صفحات و پست های بلاگ قابل فعالسازی و غیر فعال کردن هستند</p>

<h4>مدیریت نظرهای ارسال شده</h4><hr>
<p>نظرهای ارسال شده می توانند تایید شده و یا تایید نشده باشند و فقط نظر های تایید شده در سایت نمایش داده میشوند، همچنین شما میتوانید نظرات را حذف کنید</p>";