<?php defined('BASEPATH') or exit('No direct script access allowed');

// labels
$lang['header']			=	'Βήμα 4: Δημιουργία Διαχειριστή';
$lang['intro_text']		=	'Συμπληρώστε την παρακάτω φόρμα με τις πληροφορίες του διαχειριστή και πατήστε το κουμπί "Εγκατάσταση" για να ολοκληρώσετε την εγκατάσταση του PyroCMS.';

$lang['default_user']	=	'Αρχικός Χρήστης';
$lang['database']		=	'Βάση Δεδομένων';
$lang['site_settings']		= 	'Ρυθμίσεις Ιστοτόπου';
$lang['site_ref']		=	'Αναφορικό Ιστοτόπου';
$lang['user_name']		= 	'Όνομα Χρήστη';
$lang['first_name']		= 	'Όνομα';
$lang['last_name']		=	'Επώνυμο';
$lang['email']			=	'Email';
$lang['password']		= 	'Συνθηματικό';
$lang['conf_password']	=	'Επανάληψη συνθηματικού';
$lang['finish']			=	'Εγκατάσταση';

$lang['invalid_db_name'] =  'Το όνομα που εισάγατε για την βάση δεδομένων δεν είναι έγκυρο. Παρακαλούμε να χρησιμοποιήσετε χαρακτήρες λατινικού αλφάβητου και κάτω παύλες.';
$lang['error_101']		=	'Η βάση δεδομένων δεν βρέθηκε. Αν ζητήσατε από το πρόγραμμα εγκατάστασης να την δημιουργήσει μπορεί να απέτυχε λόγω δικαιωμάτων.';
$lang['error_102']		=	'Το πρόγραμμα εγκατάστασης δεν μπόρεσε να προσθέσει πίνακες στην βάση δεδομένων.';
$lang['error_103']		=	'Το πρόγραμμα εγκατάστασης δεν μπόρεσε να εισάγει δεδομένα στην βάση δεδομένων.';
$lang['error_104']		=	'Το πρόγραμμα εγκατάστασης δεν μπόρεσε να δημιουργήσει τον αρχικό χρήστη.';
$lang['error_105']		=	'Το αρχείο των ρύθμισεων database δεν ήταν δυνατό να εγγραφεί, μήπως προσπεράσατε το βήμα 3;';
$lang['error_106']		=	'Το αρχείο των ρυθμίσεων δεν ήταν δυνατό να εγγραφεί, είσαστε σίγουροι ότι το αρχείο έχει τα σωστά δικαιώματα;';
$lang['success']		=	'Το PyroCMS εγκαταστάθηκε με επιτυχία.';