<?php if (!defined('BASEPATH')) exit('No direct script access allowed');

// labels
$lang['header']			=	'Βήμα 4: Δημιουργία Βάσης Δεδομένων';
$lang['intro_text']		=	'Συμπληρώστε την παρακάτω φόρμα και πατήστε το κουμπί "Εγκατάσταση" για να εγκαταστήσετε το PyroCMS. Να είσαστε σίγουροι ότι εγκαθιστάτε το PyroCMS στην σωστή βάση δεδομένων διότι όλες οι αλλαγές θα χαθούν!';

$lang['db_settings']	=	'Ρυθμίσεις Βάσης Δεδομένων';
$lang['db_create']		=	'Δημιουργία Βάσης Δεδομένων';
$lang['db_notice']		=	'Μπορεί να χρειαστεί να το κάνετε χειροκίνητα';
$lang['default_user']	=	'Αρχικός Χρήστης';
$lang['database']		=	'Βάση Δεδομένων';
$lang['site_settings']		= 	'Ρυθμίσεις Ιστοτόπου';
$lang['site_ref']		=	'Αναφορικό Ιστοτόπου';
$lang['user_name']		= 	'Όνομα Χρήστη';
$lang['first_name']		= 	'Όνομα';
$lang['last_name']		=	'Επώνυμο';
$lang['email']			=	'Email';
$lang['password']		= 	'Συνθηματικό';
$lang['conf_password']	=	'Επανάληψη συνθηματικού';
$lang['finish']			=	'Εγκατάσταση';

$lang['error_101']		=	'Η βάση δεδομένων δεν βρέθηκε. Αν ζητήσατε από το πρόγραμμα εγκατάστασης να την δημιουργήσει μπορεί να απέτυχε λόγω δικαιωμάτων.';
$lang['error_102']		=	'Το πρόγραμμα εγκατάστασης δεν μπόρεσε να προσθέσει πίνακες στην βάση δεδομένων.';
$lang['error_103']		=	'Το πρόγραμμα εγκατάστασης δεν μπόρεσε να εισάγει δεδομένα στην βάση δεδομένων.';
$lang['error_104']		=	'Το πρόγραμμα εγκατάστασης δεν μπόρεσε να δημιουργήσει τον αρχικό χρήστη.';
$lang['error_105']		=	'Το αρχείο των ρύθμισεων database δεν ήταν δυνατό να εγγραφεί, μήπως προσπεράσατε το βήμα 3;';
$lang['error_106']		=	'Το αρχείο των ρυθμίσεων δεν ήταν δυνατό να εγγραφεί, είσαστε σίγουροι ότι το αρχείο έχει τα σωστά δικαιώματα;';
$lang['success']		=	'Το PyroCMS εγκαταστάθηκε με επιτυχία.';

/* End of file step_4_lang.php */
/* Location: ./installer/language/greek/step_4_lang.php */