<?php defined('BASEPATH') OR exit('No direct script access allowed');

$lang['permissions.group']                  = 'Ομάδα';
$lang['permissions.roles']                  = 'Ρόλοι';
$lang['permissions.edit']                   = 'Επεξεργασία Δικαιωμάτων';

$lang['permissions.introduction']           = 'Μπορείτε να δηιμουργήσετε παραμετροποιημένα δικαιώματα για διαφορετικούς χρήστες με το να τους αντιστοιχίσετε σε ομάδες στην περιοχή Χρήστες > Διαχείριση Χρηστών. Μετά μπορείτε να επιλέξετε την Επεξεργασία Δικαιωμάτων για την κάθε ομάδα και να ελέγξετε ποιους ρόλους και πρόσθετα θα μπορεί να χρησιμοποιεί η κάθε μια.';

$lang['permissions.message_group_saved']    = 'Τα δικαιώματα για αυτή την ομάδα αποθηκεύτηκαν.';