<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h4>ទិដ្ឋភាពទូទៅ</h4>
<p>ម៉ូឌុលមតិយោបលគឺអនុញ្ញាតឲ្យអ្នកទស្សនាអាចបញ្ចេញមតិយោបលរបស់ខ្លួននៅគ្រប់ផ្នែកលើគេហទំព័រដែលអ្នកបានអនុញ្ញាត។</p>

<h4>ការបើកបតិយោបល់</h4><hr>
<p>រាល់មតិយោបល់អាចមាន​នៅក្នុងទំព័រ ទំព័ររូបភាព និង ទំព័រ Blog។ ប្រសិនបើអ្នកចង់សម្របសម្រួលមតិយោបល អ្នក​ត្រូវតែបើលក្ខ័ណសម្របសម្រួលមតិយោបល់នៅក្នុងផ្ទាំងអ្នកគ្រប់គ្រង។</p>

<h4>ការសម្របសម្រួលមតិយោបល់</h4><hr>
<p>រាល់មតិយោបល់អាចនឹងអនុញ្ញាត ឫមិនអនុញ្ញាត បានគ្រប់ពេលនៅក្នុងផ្ទាំងអ្នកគ្រប់គ្រង។ ប្រសិនជាអ្នកអនុញ្ញាតមតិយោបល់រួច ហើយអ្នកចង់មិនអនុញ្ញាតវិញក៏អាចធ្វើបានដែរ។</p>";