<?php

$lang['db_invalid_connection_str'] = 'Невозможно определить настройки БД на основании полученной строки подключения.';
$lang['db_unable_to_connect'] = 'Невозможно соединиться с БД, используя предложенные логин/пароль.';
$lang['db_unable_to_select'] = 'Невозможно выбрать базу данных %s';
$lang['db_unable_to_create'] = 'Невозможно создать базу данных %s';
$lang['db_invalid_query'] = 'Попытка выполения неверного запроса.';
$lang['db_must_set_table'] = 'В запросе необходимо указать название таблицы.';
$lang['db_must_set_database'] = 'Необходимо указать имя БД в файле конфигурации.';
$lang['db_must_use_set'] = 'Вы должны использовать SET для обновления записи.';
$lang['db_must_use_where'] = 'Запрос на обновление данных (UPDATE) не может быть выполнен без условия WHERE.';
$lang['db_del_must_use_where'] = 'Запрос на удаление данных (DELETE) не может быть выполнен без условия WHERE.';
$lang['db_field_param_missing'] = 'Для получения данных необходимо передать название таблицы в качестве параметра.';
$lang['db_unsupported_function'] = 'Для текущей БД эта операция недоступна.';
$lang['db_transaction_failure'] = 'Транзакция прервана: выполнен откат.';
$lang['db_unable_to_drop'] = 'Невозможно удалить БД.';
$lang['db_unsuported_feature'] = 'Вы пытаетесь использовать операции, неподдериживаемые для данной БД.';
$lang['db_unsuported_compression'] = 'Выбраный вами формат сжатия не поддерживается сервером.';
$lang['db_filepath_error'] = 'Невозможно произвести запись в указанное вами место.';
$lang['db_invalid_cache_path'] = 'Путь для кэша неверен или отсутствует права на запись.';
$lang['db_table_name_required'] = 'Для выполнения оперции необходимо указать имя таблицы.';
$lang['db_column_name_required'] = 'Для выполнения оперции необходимо указать имя столбца.';
$lang['db_column_definition_required'] = 'Для выполнения оперции необходимо определить столбец.';
$lang['db_unable_to_set_charset'] = 'Невозможно установить кодировку %s для соедниения с БД.';
$lang['db_error_heading'] = 'Ошибка БД';
