<?php
$lang['ftp_no_connection']			= 'Невозможно установить FTP-соединение.  Убедитесь, что вы смогли соединиться с сервером, прежде чем начнете выполнять операции с файлами.';
$lang['ftp_unable_to_connect']		= 'Невозможно установить соединение с указанным FTP-сервером.';
$lang['ftp_unable_to_login']		= 'Ошибка входа на FTP-сервер.  Проверьте имя пользователя и пароль.';
$lang['ftp_unable_to_makdir']		= 'Невозможно создать указанную директорию.';
$lang['ftp_unable_to_changedir']	= 'Невозможно сменить директорию.';
$lang['ftp_unable_to_chmod']		= 'Невозможно установить права доступа.  Проверьте путь.  Внимание: эта функция работает, начиная с версии PHP5.';
$lang['ftp_unable_to_upload']		= 'Невозможно загрузить указанный файл.  Проверьте путь к файлу.';
$lang['ftp_no_source_file']			= 'Невозможно найти указанный файл.  Проверьте путь к файлу.';
$lang['ftp_unable_to_rename']		= 'Невозможно переименовать файл.';
$lang['ftp_unable_to_delete']		= 'Невозможно удалить файл.';
$lang['ftp_unable_to_move']			= 'Невозможно переместить файл.  Убедитесь, что целевая директория существует.';