<?php
$lang['imglib_source_image_required'] = 'Укажите имя файла исходного изображения.';
$lang['imglib_gd_required'] = 'Для выполнения этой операции необходима библиотека GD.';
$lang['imglib_gd_required_for_props'] = 'На вашем сервере должна быть установлена библиотека GD для получения значений свойств изображений.';
$lang['imglib_unsupported_imagecreate'] = 'На вашем сервере отсутствует функция поддержки работы с данным типом изображения.';
$lang['imglib_gif_not_supported'] = 'Обычно поддержка изображений GIF отсутствует в связи с лицензионными ограничениями.  Вместо этого вы можете использовать JPG или PNG.';
$lang['imglib_jpg_not_supported'] = 'Не установлена поддержка JPG';
$lang['imglib_png_not_supported'] = 'Не установлена поддержка PNG';
$lang['imglib_jpg_or_png_required'] = 'Выбранная вами библиотека обработки изображений поддерживает только JPG или PNG-файлы.';
$lang['imglib_copy_error'] = 'Ошибка при попытке перезаписать файл.  Убедитесь, что для этой директории разрешена запись.';
$lang['imglib_rotate_unsupported'] = 'Похоже, что поворот изображения не поддерживается библиотекой.';
$lang['imglib_libpath_invalid'] = 'Путь к библиотеке обработки изображений некорректен.  Пожалуйста, исправьте его.';
$lang['imglib_image_process_failed'] = 'Невозможно обработать изображение.  Убедитесь, что ваш сервер поддерживает выбранный вами пакет для обработки изображений, а также правильность пути к этим пакетам.';
$lang['imglib_rotation_angle_required'] = 'Необходимо указать значение угла для осуществления поворота изображения.';
$lang['imglib_writing_failed_gif'] = 'изображение GIF'; // Упоминаний об этой ошибке в файлах кода нет, поэтому неясно, что имел ввиду ее автор :)
$lang['imglib_invalid_path'] = 'Путь к изображению некорректен.';
$lang['imglib_copy_failed'] = 'Невозможно выполнить функцию копирования файла изображения.';
$lang['imglib_missing_font'] = 'Шрифт не найден.';