<?php

$lang['db_invalid_connection_str'] = 'Δεν ήταν δυνατό να καθοριστούν οι ρυθμίσεις της σύνδεσης στην βάση δεδομένων από την γραμμή κειμένου που υποβάλλατε.';
$lang['db_unable_to_connect'] = 'Δεν ήταν δυνατή η σύνδεση στην βάση δεδομένων κάνοντας χρήση των ρυθμίσεων που παρείχθησαν.';
$lang['db_unable_to_select'] = 'Δεν ήταν δυνατή η επιλογή της βάσης δεδομένων: %s';
$lang['db_unable_to_create'] = 'Δεν ήταν δυνατή η δημιουργία της βάση δεδομένων: %s';
$lang['db_invalid_query'] = 'Το ερώτημα που υποβάλλατε δεν είναι έγκυρο.';
$lang['db_must_set_table'] = 'Πρέπει να ορίσετε τον πίνακα της βάσης δεδομένων πάνω στον οποίο θα εκτελεστεί το ερώτημά σας.';
$lang['db_must_use_set'] = 'Πρέπει να χρησιμοποιήσετε την εντολή "set" για να ενημερώσετε μια ήδη υπάρχουσα εγγραφή.';
$lang['db_must_use_index'] = 'Πρέπει να ορίσετε ένα index για να είναι δυνατό το ταίριασμα για μαζικές ενημερώσεις.';
$lang['db_batch_missing_index'] = 'Το ορισμένο index λείπει από μια ή περισσότερες εγγραφές που υποβλήθηκαν για μαζική ενημέρωση.';
$lang['db_must_use_where'] = 'Οι εντολές για ενημέρωση εγγραφών δεν επιτρέπονται εκτός και αν περιέχουν περιορισμούς "where" ή "like".';
$lang['db_del_must_use_where'] = 'Οι εντολές για διαγραφή εγγραφών δεν επιτρέπονται εκτός και αν περιέχουν περιορισμούς "where" ή "like".';
$lang['db_field_param_missing'] = 'Για την ανάκτηση πεδίων πρέπει να παρέχεται το όνομα του πίνακα ως παράμετρος.';
$lang['db_unsupported_function'] = 'Αυτή η λειτουργία δεν είναι διαθέσιμη στην βάση που χρησιμοποιείται.';
$lang['db_transaction_failure'] = 'Αποτυχία Transaction: εφαρμόστηκε rollback.';
$lang['db_unable_to_drop'] = 'Δεν ήταν δυνατό να καταργηθεί η βάση δεδομένων που ορίσατε.';
$lang['db_unsuported_feature'] = 'Λειτουργία που δεν υποστηρίζεται από το λογισμικό της βάσης δεδομένων που χρησιμοποιείτε.';
$lang['db_unsuported_compression'] = 'Η μορφή συμπιεσμένου αρχείου που έχετε επιλέξει δεν υποστηρίζεται από τον διακομιστή σας.';
$lang['db_filepath_error'] = 'Δεν είναι δυνατό να εγγραφούν δεδομένα στην διαδρομή αρχείο που υποβάλλατε.';
$lang['db_invalid_cache_path'] = 'Η διαδρομή cache που έχει υποβάλλει δεν είναι έγκυρη ή δεν είναι εγγράψιμη.';
$lang['db_table_name_required'] = 'Απαιτείται ένα όνομα πίνακα για αυτήν την ενέργεια.';
$lang['db_column_name_required'] = 'Απαιτείται ένα όνομα στήλης για αυτήν την ενέργεια.';
$lang['db_column_definition_required'] = 'Απαιτείται ο ορισμός μιας στήλης για αυτήν την ενέργεια.';
$lang['db_unable_to_set_charset'] = 'Δεν είναι δυνατό να οριστεί το character set της σύνδεσης σε: %s';
$lang['db_error_heading'] = 'Συνέβη κάποιο σφάλμα της βάσης δεδομένων';

/* End of file db_lang.php */
/* Location: ./system/language/greek/db_lang.php */