<?php

$lang['required']			= "Το πεδίο %s απαιτείται.";
$lang['isset']				= "Το πεδίο %s πρέπει να έχει μια τιμή.";
$lang['valid_email']		= "Το πεδίο %s πρέπει να περιέχει μια έγκυρη διεύθυνση email.";
$lang['valid_emails']		= "Το πεδίο %s πρέπει να περιέχει έγκυρες διευθύνσεις mail.";
$lang['valid_url']			= "Το πεδίο %s πρέπει να περιέχει μια έγκυρη URL.";
$lang['valid_ip']			= "Το πεδίο %s πρέπει να περιέχει μια έγκυρη IP.";
$lang['min_length']			= "Το πεδίο %s πρέπει να έχει τουλάχιστον %s χαρακτήρες.";
$lang['max_length']			= "Το πεδίο %s δεν πρέπει να υπερβαίνει τους %s χαρακτήρες.";
$lang['exact_length']		= "Το πεδίο %s πρέπει να είναι ακριβώς %s χαρακτήρες.";
$lang['alpha']				= "Το πεδίο %s πρέπει να περιέχει μόνο χαρακτήρες που να είναι γράμματα του αλφάβητου.";
$lang['alpha_numeric']		= "Το πεδίο %s πρέπει να περιέχει μόνο χαρακτήρες που να είναι γράμματα του αλφάβητου και αριθμούς.";
$lang['alpha_dash']			= "Το πεδίο %s πρέπει να περιέχει μόνο χαρακτήρες που να είναι γράμματα του αλφάβητου, αριθμούς κάτω παύλες και παύλες.";
$lang['numeric']			= "Το πεδίο %s πρέπει να περιέχει μόνο αριθμούς.";
$lang['is_numeric']			= "Το πεδίο %s πρέπει να περιέχει μόνο αριθμητικούς χαρακτήρες.";
$lang['integer']			= "Το πεδίο %s πρέπει να περιέχει έναν ακέραιο.";
$lang['regex_match']		= "Το πεδίο %s δεν έχει σωστή μορφή";
$lang['matches']			= "Το πεδίο %s δεν ταυτίζεται με το πεδίο %s.";
$lang['is_natural']			= "Το πεδίο %s πρέπει να περιέχει μόνο θετικούς αριθμούς.";
$lang['is_natural_no_zero']	= "Το πεδίο %s πρέπει να περιέχει έναν αριθμό μεγαλύτερο του μηδέν.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/greek/form_validation_lang.php */