<?php

$lang['upload_userfile_not_set'] = "Δεν ήταν δυνατό να βρεθεί μια μεταβλητή POST με το όνομα userfile.";
$lang['upload_file_exceeds_limit'] = "Το μέγεθος του αρχείου που ανέβηκε ξεπερνά το μέγιστο επιτρεπόμενο μέγεθος που ορίζεται στις ρυθμίσεις της PHP.";
$lang['upload_file_exceeds_form_limit'] = "Το μέγεθος του αρχείου που ανέβηκε ξεπερνά το μέγιστο επιτρεπόμενο μέγεθος που ορίζεται στις ρυθμίσεις της φόρμας υποβολής.";
$lang['upload_file_partial'] = "Ανέβηκε μονάχα ένα μέρος του αρχείου.";
$lang['upload_no_temp_directory'] = "Λείπει η διαδρομή προσωρινής αποθήκευσης.";
$lang['upload_unable_to_write_file'] = "Το αρχείο δεν ήταν δυνατό να γραφεί στον δίσκο.";
$lang['upload_stopped_by_extension'] = "Το ανέβασμα του αρχείου εμποδίστηκε από μια επέκταση.";
$lang['upload_no_file_selected'] = "Δεν έχετε επιλέξει ένα αρχείο για ανέβασμα.";
$lang['upload_invalid_filetype'] = "Ο τύπος αρχείου που προσπαθείτε να ανεβάσετε δεν επιτρέπεται.";
$lang['upload_invalid_filesize'] = "Το αρχείο που προσπαθείτε να ανεβάσετε έχει μέγεθος μεγαλύτερο από το επιτρεπόμενο.";
$lang['upload_invalid_dimensions'] = "Η εικόνα που προσπαθείτε να ανεβάσετε ξεπερνά το μέγιστο επιτρεπόμενο ύψος ή πλάτος.";
$lang['upload_destination_error'] = "Παρουσιάστηκε κάποιο πρόβλημα κατά την μεταφορά του ανεβασμένου αρχείου στον τελικό του προορισμό.";
$lang['upload_no_filepath'] = "Η διαδρομή για την αποθήκευση των ανεβασμένων αρχείων δεν φαίνεται να είναι έγκυρη.";
$lang['upload_no_file_types'] = "Δεν έχετε ορίσει ποιοι είναι οι επιτρεπόμενοι τύποι αρχείων.";
$lang['upload_bad_filename'] = "Το όνομα αρχείου που έχετε υποβάλλει υπάρχει ήδη στον διακομιστή.";
$lang['upload_not_writable'] = "Ο φάκελος για την αποθήκευση των ανεβασμένων αρχείων φαίνεται να μην είναι εγγράψιμος.";


/* End of file upload_lang.php */
/* Location: ./system/language/greek/upload_lang.php */