<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "

<h4>ទិដ្ឋភាពទូទៅ</h4>
<p>
	ម៉ូឌុល Blog គឺជាឧបករណ៍សាមញ្ញសម្រាប់បោះពុម្ពផ្សាយសំរាប់ blog ដែលបានបញ្ចូល។
</p>

<h4>ប្រភេទ</h4>
<p>
	អ្នកអាចបង្កើតប្រភេទជាច្រើនដូចជាអ្នកចូលចិត្តដើម្បីរៀបចំការរាល់ប្រកាសរបស់អ្នក។ ប្រសិនបើអ្នកចង់ឲ្យអ្នកទស្សនារបស់អ្នកអាចស្វែងរកប្រភេទរបស់អ្នកដែលភ្ចាប់នឹងប្រភេទមុខងារតូចៗរបស់ Blog នៅលើទំព័រខាងមុខ។
</p>

<h4>រាល់ប្រកាស</h4>
<p>
	ជ្រើសចំណងជើងល្អសម្រាប់ប្រកាសរបស់អ្នកដូចដែលពួកគេនឹងត្រូវបានបង្ហាញនៅលើទំព័រ Blog មេ (រួមជាមួយនឹងសេចក្ដីណែនាំ) ហើយនឹងត្រូវបានប្រើជាចំណងជើងនៅក្នុងលទ្ធផល search engine។ បន្ទាប់ពីការបង្កើតប្រកាសអ្នកអាចរក្សាទុកវាសំរាប់ការបោះពុម្ពផ្សាយ ឫ​អ្នកអាចរក្សាទុកវាជាសេចក្តីព្រាង ប្រសិនបើអ្នកចង់កែវាពេលក្រោយ។ អ្នកអាចរក្សាទុកសំរាប់ផ្សាយ ប៉ុន្តែកំណត់កាលបរិច្ឆេទក្នុងពេលអនាគតសំរាប់ប្រកាសរបស់អ្នកនឹងមិនបង្ហាញរហូតដល់កាលបរិច្ឆេទនោះ។
</p>

";