<?php if (!defined('BASEPATH')) exit('No direct script access allowed');

/**
* Thai translation.
*
* @author	Nateetorn Lertkhonsan <nateetorn.l@gmail.com>
* @package	PyroCMS  
* @link		http://pyrocms.com
* @date		2012-04-20
* @version	1.0.0
**/

// labels
$lang['header']			=	'ขั้นตอนที่ 4: การสร้างฐานข้อมูล';
$lang['intro_text']		=	'กรอกแบบฟอร์มด้านล่างและกดปุ่มที่มีข้อความ "ติดตั้ง" เพื่อติดตั้ง PyroCMS. ต้องแน่ใจว่าได้ติดตั้ง PyroCMS ลงในฐานข้อมูลที่ถูกต้อง ไม่อย่างนั้นการเปลี่ยนแปลงทั้งหมดที่มีอยู่จะหายไป!';

$lang['db_settings']		=	'การตั้งค่าฐานข้อมูล';
$lang['db_create']		=	'สร้างฐานข้อมูลใหม่';
$lang['db_notice']		=	'คุณสามารถป้อนข้อมูลที่ต้องการลงไปได้';
$lang['default_user']		=	'ผู้ใช้เริ่มต้น';
$lang['database']		=	'ชื่อฐานข้อมูล';
$lang['site_settings']		= 	'การตั้งค่าไซต์';
$lang['site_ref']		=	'อ้างอิงเว็บไซต์';
$lang['user_name']		= 	'บัญชีผู้ใช้งาน';
$lang['first_name']		= 	'ชื่อ';
$lang['last_name']		=	'สกุล';
$lang['email']			=	'อีเมล';
$lang['password']		= 	'รหัสผ่าน';
$lang['conf_password']		=	'ยืนยันรหัสผ่าน';
$lang['finish']			=	'ติดตั้ง';

$lang['invalid_db_name'] = 'ชื่อฐานข้อมูลที่คุณป้อนไม่ถูกต้อง กรุณาใช้เฉพาะตัวอักษรและตัวเลขเท่านั้นและขีด';
$lang['error_101']		=	'ไม่พบฐานข้อมูล หากคุณแน่ใจว่าได้สร้างฐานข้อมูลแล้วอาจจะมีปัญหาในเรื่องสิทธิ์ของผู้ใช้ฐานข้อมูล';
$lang['error_102']		=	'ตัวช่วยติดตั้งไม่สามารถเพิ่มตารางใด ๆ ไปยังฐานข้อมูล.';
$lang['error_103']		=	'ตัวช่วยติดตั้งไม่สามารถแทรกข้อมูลไปยังฐานข้อมูล.';
$lang['error_104']		=	'ตัวช่วยติดตั้งไม่สามารถสร้างผู้ใช้เริ่มต้น';
$lang['error_105']		=	'ไฟล์ตั้งค่าของฐานข้อมูลไม่สามารถเขียนทับได้, ให้แน่ใจว่าไม่ได้ข้ามขั้นตอนที่ 3 ไป?';
$lang['error_106']		=	'ไฟล์ตั้งค่าของเว็บไซต์ไม่สามารถเขียนทับได้ กรุณาตรวจสอบสิทธิ์อีกครั้ง?';
$lang['success']		=	'PyroCMS ได้ถูกติดตั้งสมบรูณ์แล้ว';

/* End of file step_4_lang.php */