<?php defined('BASEPATH') OR exit('No direct script access allowed');

/**
* Thai translation.
*
* @author	Nateetorn Lertkhonsan <nateetorn.l@gmail.com>
* @package	PyroCMS  
* @link		http://pyrocms.com
* @date		2012-04-20
* @version	1.0.0
**/

// labels
$lang['header']			=	'ขั้นตอนที่ 2: ตรวจสอบความต้องการของระบบ';
$lang['intro_text']		= 	'ขั้นตอนที่สองจะเป็นกระบวนการตรวจสอบการติดตั้งเพื่อตรวจสอบว่าเซิร์ฟเวอร์ของคุณสนับสนุน PyroCMS เซิร์ฟเวอร์ส่วนใหญ่ควรจะสามารถทำงานได้โดยไม่มีปัญหาใด ๆ.';
$lang['mandatory']		= 	'บังคับ';
$lang['recommended']	= 	'แนะนำ';

$lang['server_settings']= 	'การตั้งค่า HTTP Server';
$lang['server_version']	=	'ซอฟต์แวร์เซิร์ฟเวอร์ของคุณ:';
$lang['server_fail']	=	'ซอฟต์แวร์เซิร์ฟเวอร์ของคุณไม่ได้รับการสนับสนุน PyroCMS จึงอาจจะหรืออาจไม่ทำงาน. ตราบใดที่ PHP และ MySQL ติดตั้งอยู่และ PyroCMS ได้ถูกปรับปรุงใหม่อยุ่เสมอ ก็น่าจะใช้งานได้อย่างปกติ, ลองไม่ต้อง Clean URL';

$lang['php_settings']	=	'การตั้งค่า PHP';
$lang['php_required']	=	'PyroCMS ต้องการ  PHP รุ่น %s หรือสูงกว่า.';
$lang['php_version']	=	'เซิร์ฟเวอร์ของคุณกำลังทำงานอยู่ในรุ่น';
$lang['php_fail']		=	'รุ่น PHP ของคุณไม่ได้รับการสนับสนุน PyroCMS ต้องการ PHP รุ่น %s หรือสูงกว่าเพื่อให้ทำงานได้อย่างถูกต้อง';

$lang['mysql_settings']	=	'การตั้งค่า MySQL';
$lang['mysql_required']	=	'PyroCMS ต้องการฐานข้อมูล MySQL ที่ใช้รุ่น 5.0 หรือสูงกว่า.';
$lang['mysql_version1']	=	'เซิร์ฟเวอร์ของคุณกำลังทำงานอยู่';
$lang['mysql_version2']	=	'ไคลเอนซ์ของคุณกำลังทำงานอยู่';
$lang['mysql_fail']		=	'รุ่น MySQL ของคุณไม่ได้รับการสนับสนุน PyroCMS ต้องรุ่น MySQL 5.0 หรือสูงกว่าเพื่อให้ทำงานได้อย่างถูกต้อง';

$lang['gd_settings']	=	'การตั้งค่า GD';
$lang['gd_required']	= 	'PyroCMS ต้องการ GD library 1.0 หรือสูงกว่าเพื่อการจัดการภาพ';
$lang['gd_version']		= 	'เซิร์ฟเวอร์ของคุณกำลังทำงานอยู่รุ่น';
$lang['gd_fail']		=	'เราไม่สามารถตรวจสอบรุ่นของ GD library ได้ ซึ่งอาจจะหมายความว่า GD library ไม่ได้ติดตั้ง PyroCMS จะยังคงทำงานอย่างถูกต้องได้ แต่บางส่วนของฟังก์ชั่นภาพอาจจะไม่ทำงาน จึงแนะนำเป็นว่าควรจะเปิด GD library ให้ทำงาน';

$lang['summary']		=	'สรุป';

$lang['zlib']			=	'Zlib';
$lang['zlib_required']	= 	'PyroCMS ต้องการ Zlib ในการสั่งงานเรื่องบีบอัดและติดตั้งธีม.';
$lang['zlib_fail']		=	'ไม่สามารถตรวจรุ่น Zlib ได้ ซึ่งอาจจะหมายความว่า Zlib ไม่ได้ติดตั้ง PyroCMS จะยังคงทำงานอย่างถูกต้อง แต่การติดตั้งธีมจะไม่ทำงาน จึงขอแนะนำให้ติดตั้ง Zlib ให้ทำงาน.';

$lang['curl']			=	'Curl';
$lang['curl_required']	=	'PyroCMS ต้องการ Curl เพื่อเชื่อมต่อไปยังเว็บไซต์อื่น ๆ';
$lang['curl_fail']		=	'เราไม่สามารถตรวจสอบรุ่นของ Curl ได้ ซึ่งอาจจะหมายความว่า Curl ไม่ได้ติดตั้ง PyroCMS จะยังคงทำงานอย่างถูกต้องได้ แต่บางส่วนของฟังก์ชั่นภาพอาจจะไม่ทำงาน จึงแนะนำเป็นว่าควรจะเปิด Curl library ให้ทำงาน';

$lang['summary_success']	=	'เซิร์ฟเวอร์ของคุณมีตามความต้องการทั้งหมดตรงกับ PyroCMS ที่จะสามารถทำงานได้อย่างถูกต้อง ไปขั้นตอนต่อไปได้โดยการคลิกที่ปุ่มด้านล่าง ';
$lang['summary_partial']	=	'ซิร์ฟเวอร์ของคุณมีคุณสมบัติตรง <em>มาก</em> ในความต้องการระบบของ PyroCMS.  ซึ่งหมายความว่า PyroCMS ควรจะสามารถทำงานอย่างถูกต้อง แต่มีโอกาสที่คุณจะประสบปัญหากับสิ่งต่างๆเช่นการปรับขนาดภาพและขนาดสร้างภาพขนาดเล็ก.';
$lang['summary_failure']	=	'ดูเหมือนว่าเซิร์ฟเวอร์ของคุณล้มเหลวที่จะตอบสนองความต้องการที่จะเรียกใช้ PyroCMS กรุณาติดต่อผู้ดูแลเซิร์ฟเวอร์หรือบริษัทโฮสติ้ง  เพื่อที่จะได้รับการแก้ไขต่อไป';
$lang['next_step']		=	'ดำเนินการขั้นตอนต่อไป';
$lang['step3']			=	'ขั้นตอนที่ 3';
$lang['retry']			=	'ลองอีกครั้ง';

// messages
$lang['step1_failure']	=	'กรุณาระบุการตั้งค่าฐานข้อมูลการตั้งค่าที่จำเป็นในแบบฟอร์มด้านล่าง .. ';

/* End of file step_2_lang.php */