<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h4>ទិដ្ឋភាពទូទៅ</h4>
<p>ម៉ូឌុល Navigation គឺគ្រប់គ្រងតំបន់ navigation មេរបស់អ្នកក៏ដូចជាក្រុមតំណភ្ជាប់ផ្សេងទៀត។</p>

<h4>ក្រុម Navigation</h4>
<p>តំណភ្ជាប់ Navigation ត្រូវបានបង្ហាញយោងតាម​​ក្រុមដែលពួកគេមាន។ នៅក្នុងក្រុមផ្នែកក្បាល themes ភាគច្រើនគឺជា navigation មេ។ ចូលពិនិត្យមើលឯកសារ theme របស់អ្នក​ដើម្បីស្វែងរកថាក្រុម navigation មួយណាស្គាល់ theme របស់អ្នក។
ប្រសិនបើអ្នកចង់បង្ហាញក្រុមនៅលើគេហទំព័រ គ្រាន់តែប្រើ  tag: {{ navigation:links group=\"your-group-name\" }មួយនេះ</p>

<h4>បន្ថែមតំណភ្ជាប់</h4>
<p>ជ្រើសរើសចំណងជើងតំណភ្ជាប់របស់អ្នក ហើយជ្រើសរើសក្រុមមួយណាដែលអ្នកចង់បង្ហាញ។
ប្រភេទតំណភ្ជាប់មានដូចខាងក្រោម:
<ul>
<li>URL: ភ្ជាប់ទៅខាងក្រៅ - http://google.com</li>
<li>ភ្ជាប់គេហទំព័រ: ការភ្ជាប់នៅក្នុងគេហទំព័ររបស់អ្នក - galleries/portfolio-pictures</li>
<li>Module: នាំអ្នកទស្សនាទៅក្នុង index page នៃម៉ូឌុល</li>
<li>ទំព័រ: ការភ្ជាប់ទៅទំព័រ</li>
</ul>
បញ្ជាក់គោលដៅ​ប្រសិនបើតំណភ្ជាប់នេះបើកក្នុងផ្ទាំងថ្មី។
(ព័ត៌មានជំនួយ: ប្រើផ្ទាំងថ្មីញឹកញាប់ដើម្បីជៀសវាងការរំខានដលល់អ្នកទស្សនាគេហទំព័រ។)
ទំរងថ្នាក់អនុញ្ញាតឲ្យអ្នកបន្ថែមថ្នាក់ css នៅក្នុងតំណភ្ជាប់មួយ។</p>
<p></p>

<h4>លំដាប់តំណភ្ជាប់ Navigation</h4>
<p>លំដាប់តំណភ្ជាប់របស់អ្នកនៅក្នុងផ្ទាំងអ្នកគ្រប់គ្រង់ត្រូវគិតពីគេហទំព័រផ្នែកខាងមុខ។
ដើម្បីផ្លាស់ប្តូរលំដាប់ដែលគេបង្ហាញ គ្រាន់តែទាញ និងទំលាក់ ពួកគេរហូតដល់ពួកគេត្រូវទីតាំងដែលចង់បាន។</p>";