<?php if (!defined('BASEPATH')) exit('No direct script access allowed');

// labels
$lang['header']			=	'الخطوة الرابعة: إنشاء قاعدة البيانات';
$lang['intro_text']		=	'أكمل بيانات الاستمارة أدناه واضغط زر "تثبيت" لتثبيت PyroCMS. تأكد من تثبيت PyroCMS في قاعدة البيانات الصحيحة حيث أن جميع البينات الموجودة مسبقاً ستفقد!';

$lang['db_settings']	=	'إعدادات قاعدة البيانات';
$lang['db_create']		=	'إنشاء قاعدة البيانات';
$lang['db_notice']		=	'قد تحتاج أن تقوم بذلك بنفسك';
$lang['default_user']	=	'إسم المستخدم الإفتراضي';
$lang['database']		=	'قاعدة البيانات';
$lang['site_settings']		= 	'إعدادات الموقع';
$lang['site_ref']		=	'مرجع الموقع';
$lang['user_name']		= 	'إسم المستخدم';
$lang['first_name']		= 	'الإسم الأول';
$lang['last_name']		=	'الإسم الأخير';
$lang['email']			=	'البريد الإلكتروني';
$lang['password']		= 	'كلمة السرّ';
$lang['conf_password']	=	'تأكيد كلمة السرّ';
$lang['finish']			=	'تثبيت';

$lang['error_101']		=	'لم يُعثر على قاعدة البيانات. إن طلبت من برنامج التثبيت إنشاء قاعدة البيانات، قد تكون العملية فشلت بسبب الصلاحيات الغير كافية.';
$lang['error_102']		=	'تعذر على برنامج التثبيت إضافة أية جداول إلى قاعدة البيانات.';
$lang['error_103']		=	'تعذر على برنامج التثبيت إدخال البيانات في قاعدة البيانات.';
$lang['error_104']		=	'تعذر على برنامج التثبيت إنشاء المستخدم الافتراضي.';
$lang['error_105']		=	'تعذرت كتابة ملف تهيئة قاعدة البيانات! هل تخطيت الخطوة الثالثة بطريقة ما؟!';
$lang['error_106']		=	'تعذرت كتابة ملف التهيئة، هل أنت متأكد أن الملف له صلاحيات صحيحة؟';
$lang['success']		=	'تم تثبيت PyroCMS بنجاح.';

/* End of file step_4_lang.php */
/* Location: ./installer/language/arabic/step_4_lang.php */
