<?php defined('BASEPATH') OR exit('No direct script access allowed');

$lang['help_body'] = "<h4>ទិដ្ឋភាពទូទៅ</h4>
<p>ម៉ូឌុលអ្នកប្រើធ្វើការរួមគ្នាជាមួយក្រុមនិងសិទ្ធិដើម្បីផ្តល់ឱ្យ PyroCMS ការត្រួតពិនិត្យការចូលដំណើរការ។</p>

<h4>បន្ថែមអ្នកប្រើ</h4>
<p>បំពេញព័ត៌មានលម្អិតរបស់អ្នកប្រើ (រួមបញ្ចូលទាំងពាក្យសម្ងាត់) និងរក្សាទុក។ ប្រសិនបើអ្នកមាន
អ៊ីម៉ែលបានបើកដំណើរការក្នុងការកំណត់កំណត់អ៊ីម៉ែលមួយនឹងត្រូវបានផ្ញើទៅអ្នកប្រើថ្មី
ជាមួយនឹងតំណសកម្មភាពមួយ។</p>

<h4>ដំណើរការអ្នកប្រើថ្មី</h4>
<p>ប្រសិនបើអ៊ីម៉ែលធ្វើឱ្យសកម្មត្រូវបានបិទនៅក្នុងការកំណត់អ្នកប្រើដែលបានចុះឈ្មោះនៅលើ
វេបសាយផ្នែកខាងមុខចុងនឹងលេចឡើងនៅក្រោមធាតុម៉ឺនុយអ្នកប្រើដែលអសកម្មរហូតដល់អ្នក
ទាំងអនុម័តឬលុបគណនីរបស់ពួកគេ។ ប្រសិនបើអ្នកប្រើប្រាស់អ៊ីម៉ែលធ្វើឱ្យសកម្មត្រូវបានអនុញ្ញាត
អាចចុះឈ្មោះដោយស្ងៀមស្ងាត់ដោយគ្មានជំនួយពីអ្នកគ្រប់គ្រងនោះ។</p>"; #translate