<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h4>Γενικά</h4><hr>
<p>Το πρόσθετο Αρχεία παρέχει άριστη διαχείριση των αρχείων που χρησιμοποιούνται στον ιστότοπο.
Εδώ αποθηκεύονται όλες οι εικόνες που εισάγονται σε σελίδες, σε γκαλερί και αναρτήσεις.
Εικόνες για χρήση σε σελίδες μπορούν να ανέβουν είτε απευθείας από τον επεξεργαστή WYSIWYG, ή μπορείτε να τις ανεβάσετε εδώ και να τις εισάγετε μέσω WYSIWYG.</p>
<p>Το πρόσθετο της διαχείρισης αρχείων λειτουργεί περίπου όπως το τοπικό σύστημα αρχείων: χρησιμοποιεί το δεξί κλίκ για την εμφάνηση ενός αναδυόμενου μενού. Μπορείτε να κάνετε κλικ σε όλα τα στοιχεία του μεσαίου τομέα.</p>

<h6>Διαχείριση Φακέλων</h6>
<p>Αφού δημιουργήσετε έναν ή περισσότερου φακέλους στο αρχικό επίπεδο μπορείτε να δημιουργήσετε όσους υποφακέλους σας χρειάζονται. Όπως: blog/images/screenshots/image.jpg και pages/audio/sample.mp3.
Τα ονόματα των φακέλων είναι μόνο για εσωτερική χρήση, το όνομα δεν εμφανίζεται στους συνδέσμους λήψης στον ιστότοπο.
Για να διαχειριστείτε έναν φάκελο, είτε κάντε κλικ πάνω του και επιλέξτε μια ενέργεια από το αναδυόμενο μενού ή κάντε διπλό κλικ για να τον ανοίξετε.</p>
Επίσης μπόρείτε να κάνετε κλικ στους φακέλους στην αριστερή στήλη για να τους ανοίξετε.</p>
<p>Αν είναι ενεργοποιημένοι οι παροχοί cloud μπορείτε να ορίσετε μια τοποθεσία για τον φάκελο με δεξί κλικ πάνω του και επιλέγοντας Λεπτομέρειες.
Στην συνέχεια μπορείτε να επιλέξετε μια υπηρεσία (για παράδειγμα \"Amazon S3\") και να εισάγεται το όνομα του bucket ή του container. Αν το bucket ή container
δεν υπάρχει θα δημιουργηθεί όταν πατήσετε Αποθήκευση. Μπορείτε να αλλάξετε την τοποθεσία μόνο σε άδειους φακέλους.</p>

<h6>Διαχείριση Αρχείων</h6>
<p>Για να διαχειριστείτε αρχεία επιλέξτε το όνομα του φακέλου στην αριστερή στήλη. Αν το αρχείο βρίσκεται σε κάποιον υποφάκελο απλά επιλέξτε τον φάκελο που ανήκει.
Εφόσον βρίσκεστε στον φάκελο αυτό, μπορείτε να επιλέξετε τον υποφάκελο και να φιλτράρετε κατά τύπο αρχείου με τα αναδυόμενα μενού στην πάνω μεριά της οθόνης.
Εφόσον βρίσκεστε στον επιθυμητό φάκελο μπορείτε να ανεβάσετε αρχεία πατώντας το κουμπί Ανέβασμα δίπλα από το πεδίο Φίλτρων.
Σημειώστε ότι υπάρχουν δύο τρόποι να δείτε τα αρχεία σας: Λίστα και Πλέγμα. Η Λίστα προβάλλει τα αρχεία και τις λεπτομέρειές τους ενώ το Πλέγμα θα προβάλλει μια μικρογραφία των εικόνων.</p>

<h6>Ανέβασμα Αρχείων</h6>
<p>Αφότου κάνετε κλικ στο κουμπί Ανέβασμα ενώ βρίσκεστε στον επιθυμητό φάκελο, θα δείτε ένα διάλογο για το ανέβασμα αρχείων.
Μπορείτε να προσθέσετε αρχεία είτε σέρνοντάς και αφήνοντάς τα στο πεδίο Ανέβασμα Αρχείων ή απλώς να κάνετε κλικ στο πεδίο αυτό και να διαλέξετε τα αρχεία από τον υπολογιστή σας χρησιμοποιώντας το σύνηθες παράθυρο διαλόγου.
Τα επιλεγμένα αρχεία θα προβάλλονται σε λίστα στο κάτω μέρος της οθόνης.
Τότε μπορείτε είτε να διαγράψετε τα αρχεία που δεν χρειάζεστε ή αν είσαστε ικανοποιημένοι να πατήσετε το Ανέβασμα για να ξεκινήσει η διαδικασία μεταφόρτωσης.</p>
<p>Αν κάποια μεταφόρτωση δεν είναι επιτυχής, ελέγξτε το μέγεθος των αρχείων. Πολλοί hosts δεν επιτρέπουν το ανέβασμα αρχείων που είναι μεγαλύτερα από 2MB.
Πολλές νέες φωτογραφικές μηχανές μπορούν να παράξουν αρχεία μεγαλύτερα από 5MB.
Για να τακτοποιήσετε αυτόν τον περιορισμό μπορείτε είτε να ζητήσετε από τον host σας να σας αλλάξει το όριο για το ανέβασμα των αρχείων ή απλώς να σμικρύνετε τις εικόνες σας προτού τις ανεβάσετε.
Η σμίκρυνση των εικόνων έχει το επιπρόσθετο αποτέλεσμα των γρηγορότερων μεταφορτώσεων. Μπορείτε επίσης να αλλάξετε το όριο για το μέγεθος των αρχείων μέσα στο
CP > Αρχεία > Ρυθμίσεις αλλά αυτή η ρύθμιση είναι δευτερεύουσα της ρύθμισης ορίου του host. Για παράδειγμα αν ο host σας επιτρέπει την μεταφόρτωση αρχείων 50MB μπορείτε και σε αυτήν την περίπτωση να περιορίσετε το μέγεθος
των μεταφορτώσεων θέτωντας την ρύθμιση για το όριο αρχείων στο (για παράδειγμα) \"20\" στο CP > Αρχεία > Ρυθμίσεις.</p>

<h6>Συγχρονισμός Αρχείων</h6>
<p>Αν αποθηκεύεται αρχεία σε έναν πάροχο cloud μπορείτε να χρησιμοποιήσετε την λειτουργία συγχρονισμού. Αυτό σας επιτρέπει να \"ανανεώσετε\"
την βάση δεδομένων για τα αρχεία σας με την απομακρυσμένη τοποθεσία αποθήκευσης. Για παράδειγμα αν έχετε μια άλλη υπηρεσία
που αφήνει αρχεία σε έναν φάκελο στο Amazon τα οποία θα θέλατε να προβάλλεται στην εβδομαδιαία σας ανάρτηση ιστολογίου μπορείτ απλώς να μεταβείτε στον φάκελο
που είναι συνδεδεμένος με αυτό το bucket και να πατήσετε το Συγχρονισμός. Αυτό θα τραβήξει όλες τις διαθέσιμες πληροφορίες από το Amazon και
θα τις αποθηκεύσει στην βάση δεδομένων όπως θα γινόταν αν γινόταν χρήση της διεπαφής του πρόσθετου Αρχεία. Τα αρχεία θα είναι πλέον διαθέσιμα για εισαγωγή στο περιεχόμενο κάποιας σελίδας,
ανάρτησης ιστολογίου, κτλ. Αν τα αρχεία έχουν διαγραφεί από την απομακρυσμένη τοποθεσία αποθήκευσης πριν τον τελευταίο σας Συγχρονισμό τώρα θα διαγραφούν
και από την βάση δεδομένων.</p>

<h6>Αναζήτηση</h6>
<p>Μπορείτε να αναζητήσετε ένα αρχείο ή κάποιο φάκελο πληκτρολογώντας ένα όρο για αναζήτηση στην δεξιά στήλη και πατώντας Enter. Θα μπορείτε να δείτε
τα 5 πρώτα ευρήματα φακέλων και τα 5 πρώτα ευρήματα αρχείων. Όταν κάνετε κλικ σε ένα στοιχείο θα μεταβείτε στον φάκελο που τον περιέχει
και τα στοιχεία που περιέχουν τον όρο αναζήτησης θα τονιστούν. Η αναζήτηση των αρχείων γίνεται με βάση το όνομα του φακέλου, το όνομα του αρχείου, την προέκταση του αρχείου,
την τοποθεσία και το όνομα της απομακρυσμένης τοποθεσίας αποθήκευσης.</p>";