<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h4>Γενικά</h4><hr>
<p>Το πρόσθετο Αρχεία παρέχει άριστη διαχείριση των αρχείων που χρησιμοποιούνται στον ιστότοπο. 
Εδώ αποθηκεύονται όλες οι εικόνες που εισάγονται σε σελίδες, σε γκαλερί και αναρτήσεις. 
Εικόνες για χρήση σε σελίδες μπορούν να ανέβουν είτε απευθείας από τον επεξεργαστή WYSIWYG, ή μπορείτε να τις ανεβάσετε εδώ και να τις εισάγετε μέσω WYSIWYG.</p>

<h6>Διαχείριση Φακέλων</h6>
<p>Αφού δημιουργήσετε έναν ή περισσότερου φακέλους στο αρχικό επίπεδο μπορείτε να δημιουργήσετε όσους υποφακέλους σας χρειάζονται. Όπως: blog/images/screenshots/image.jpg και pages/audio/sample.mp3.
Τα ονόματα των φακέλων είναι μόνο για εσωτερική χρήση, το όνομα δεν εμφανίζεται στους συνδέσμους λήψης στον ιστότοπο.
Για να επεξεργαστείτε έναν φάκελο, επιλέξτε Διαχείριση Φακέλων στην αριστερή στήλη και μετά κάντε κλικ στο Επεξεργασία στον αντίστοιχο φάκελο που θέλετε να τροποποιήσετε.</p>

<h6>Διαχείριση Αρχείων</h6>
<p>Για να διαχειριστείτε αρχεία επιλέξτε το όνομα του φακέλου στην αριστερή στήλη. Αν το αρχείο βρίσκεται σε κάποιον υποφάκελο απλά επιλέξτε τον φάκελο που ανήκει.
Εφόσον βρίσκεστε στον φάκελο αυτό, μπορείτε να επιλέξετε τον υποφάκελο και να φιλτράρετε κατά τύπο αρχείου με τα αναδυόμενα μενού στην πάνω μεριά της οθόνης.
Εφόσον βρίσκεστε στον επιθυμητό φάκελο μπορείτε να ανεβάσετε αρχεία πατώντας το κουμπί Ανέβασμα δίπλα από το πεδίο Φίλτρων. 
Σημειώστε ότι υπάρχουν δύο τρόποι να δείτε τα αρχεία σας: Λίστα και Πλέγμα. Η Λίστα προβάλλει τα αρχεία και τις λεπτομέρειές τους ενώ το Πλέγμα θα προβάλλει μια μικρογραφία των εικόνων.</p>

<h6>Ανέβασμα Αρχείων</h6>
<p>Αφότου κάνετε κλικ στο κουμπί Ανέβασμα ενώ βρίσκεστε στον επιθυμητό φάκελο, θα δείτε ένα διάλογο για το ανέβασμα αρχείων. 
Μπορείτε να προσθέσετε αρχεία είτε σέρνοντάς και αφήνοντάς τα στο πεδίο Ανέβασμα Αρχείων ή απλώς να κάνετε κλικ στο πεδίο αυτό και να διαλέξετε τα αρχεία από τον υπολογιστή σας χρησιμοποιώντας το σύνηθες παράθυρο διαλόγου.
Τα επιλεγμένα αρχεία θα προβάλλονται σε λίστα στο κάτω μέρος της οθόνης. 
Τότε μπορείτε είτε να διαγράψετε τα αρχεία που δεν χρειάζεστε ή αν είσαστε ικανοποιημένοι να πατήσετε το Ανέβασμα για να ξεκινήσει η διαδικασία μεταφόρτωσης.
Αν κάποια μεταφόρτωση δεν είναι επιτυχής, ελέγξτε το μέγεθος των αρχείων. Πολλοί hosts δεν επιτρέπουν το ανέβασμα αρχείων που είναι μεγαλύτερα από 2MB. 
Πολλές νέες φωτογραφικές μηχανές μπορούν να παράξουν αρχεία μεγαλύτερα από 5MB. 
Για να τακτοποιήσετε αυτόν τον περιορισμό μπορείτε είτε να ζητήσετε από τον host σας να σας αλλάξει το όριο για το ανέβασμα των αρχείων ή απλώς να σμικρύνετε τις εικόνες σας προτού τις ανεβάσετε. 
Η σμίκρυνση των εικόνων έχει το επιπρόσθετο αποτέλεσμα των γρηγορότερων μεταφορτώσεων.</p>";