<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h4>Описание</h4>
<p>Навигационният модул контролира вашата основна навигационна зона, както и останалите групи от връзки.</p>

<h4>Навигационни групи</h4>
<p>Навигационните връзки се показват съобразно с това в коя група се намират. В повечето теми Header групата е главното навигационно меню.
Проверете документацията на вашата тема за да научите кои навигационни групи се поддържат.
Ако искате да покажете група в съдържанието на сайта просто използвайте: {{ navigation:links group=\"името-на-вашата-група\" }}</p>

<h4>Добавяне на връзки</h4>
<p>Изберете заглавие за вашата връзка, след това изберете групата в която искате тя да бъде показана.
Типовете връзки са както следва:
<ul>
<li>URL: външна връзка - http://google.com</li>
<li>Site Link: връзка към вашия сайт - galleries/portfolio-pictures</li>
<li>Module: препраща потребителя до началната страница на модул</li>
<li>Page: връзка към страница</li>
</ul>
Target уточнява дали връзката да бъде показана в нов прозорец или таб на браузъра.
(Съвет: избягвайте употребата на нови прозорци, това дразни вашите посетители.)
The Class позволява да добавите css класове към вашата връзка.</p>
<p></p>

<h4>Подредба на навигационните връзки</h4>
<p>Подредбата на вашите връзки в админ панела се отразява върху тяхното показване във вашият сайт.
За да промените подредбата им просто ги плъзнете и пуснете докато не останете доволни от резултата.</p>";