<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "

<h4>کلیات</h4>
<p>
	ماژول بلاگ یک ابزار ساده برای منتشر کردن مقالات در وبسایت شماست.
</p>

<h4>مجموعه ها</h4>
<p>
	شما می توانید مقالات بلاگ خود را با استفاده از مجموعه ها دسته بندی و مرتب نمایید و به هر تعدادی که می خواهید می توانید مجموعه داشته باشید
        برای نمایش نام مجموعه ها در سایت برای کاربران میتوانید از ویجت مجموعه ها استفاده نمایید
</p>

<h4>پست ها</h4>
<p>
	یک نام خوب برای پست خود انتخاب کنید و این نام در قسمت بلاگ در سایت شما نمایش داده می شود.
            این عنوان در موتور های جستجو نیز مورد استفاده قرار خواهد گرفت. شما می توانید بعد از ایجاد یک پست آن را در وضعیت  پیشنویس و یا منتظر شده قرار بدهید . 
            تفاوت اینجاست که پست هایی که به وضعیت منتشر شده باشند در سایت برای کاربران نمایش داده می شوند ولی پیشنویس ها نمایش داده نمی شوند
</p>

";