<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h6>ទិដ្ឋភាពទូទៅ</h6><hr>
<p>ឯកសារ ម៉ូឌុល គឺជាវិធីដ៏ល្អសម្រាប់អ្នកគ្រប់គ្រងវែបសាយត៍ដើម្បីគ្រប់គ្រងឯកសារនៅក្នុងការប្រើប្រាស់នៅលើតំបន់បណ្ដាញនេះ។​ រូបភាពឬឯកសារទាំងអស់ដែលត្រូវបានបញ្ចូលទៅក្នុងទំព័ររូបភាព ឬ ការប្រកាសកំណត់ហេតុ ត្រូវបានរក្សាទុកនៅទីនេះ។ សម្រាប់រូបភាពទំព័រមាតិការបស់ពួកគេដែលអាចផ្ទុកឡើងដោយផ្ទាល់ពីកម្មវិធី WYSIWYG ឬពួកវាអាចផ្ទុកឡើងនៅទីនេះ ហើយគ្រាន់តែពួកគេការបញ្ចូលតាមរយៈកម្មវិធី WYSIWYG</p>
<p>ទ្រង់ទ្រាយឯកសារច្រើនធ្វើការដូចប្រព័ន្ធឯកសារមូលដ្ឋាន: វាប្រើការចុចកណ្ដុរខាងស្ដាំដើម្បីបង្ហាញម៉ឺនុយបរិបទ។អ្វីគ្រប់យ៉ាងនៅ ក្នុងផ្ទាំង គឺអាចចុចបាន។</p>

<h6>គ្រប់គ្រងថត</h6>
<p>បន្ទាប់ពីអ្នកបង្កើតថតឬថតកម្រិតកំពូលអ្នកអាចបង្កើតថតរងបានច្រើនតាមដែលអ្នកត្រូវការដូចជា blog/images/screenshots/ or pages/audio/.
ឈ្មោះថតត្រូវបានសម្រាប់ការប្រើប្រាស់របស់អ្នកតែឈ្មោះនេះមិនត្រូវបានបង្ហាញក្នុងតំណទាញយកនៅខាងមុខ។
ដើម្បីគ្រប់គ្រងថតណាមួយចុចកណ្ដុរខាងស្ដាំនៅលើវាហើយជ្រើសសកម្មភាពពីម៉ឺនុយដែលជាលទ្ធផលឬចុចទ្វេរដងលើថតដើម្បីបើកវា។
អ្នកក៏អាចចុចលើថតក្នុងជួរឈរឆ្វេងដើម្បីបើកពួកវា។</p>
<p>ប្រសិនបើអ្នកផ្តល់សេវាពពកត្រូវបានបើកអ្នកនឹងអាចកំណត់ទីតាំងនៃថតដោយចុចកណ្ដុរខាងស្ដាំលើថតហើយបន្ទាប់មកជ្រើសសេចក្ដីលម្អិត។
បន្ទាប់មកអ្នកអាចជ្រើសទីតាំងមួយ (ឧទាហរណ៍ \"Amazon S3\") 
ហើយដាក់នៅក្នុងឈ្មោះរបស់ដាក់ធុងឬឧបករណ៍ផ្ទុកពីចម្ងាយរបស់អ្នក។ ប្រសិនបើដាក់ធុងឬធុងធ្វើ មិនមានវានឹងត្រូវបានបង្កើតនៅពេលដែលអ្នកចុចរក្សាទុក។ ចំណាំថាអ្នកអាចផ្លាស់ប្តូរបានតែទីតាំងនៃថតទទេមួយ។</p>

<h6>គ្រប់គ្រងឯកសារ</h6>
<p>ដើម្បីគ្រប់គ្រងឯកសាររុករកថតដោយប្រើមែកធាងថតនៅក្នុងជួរឈរខាងឆ្វេងឬដោយចុចលើថតក្នុង​ផ្ទាំងកណ្តាលនេះ។
ពេលដែលអ្នកកំពុងមើលឯកសារដែលអ្នកអាចកែសម្រួលពួកវាដោយចុចកណ្ដុរខាងស្ដាំនៅលើពួកវា។ អ្នកក៏អាចបញ្ជាឱ្យពួកគេដោយអូសពួកវាទៅក្នុងទីតាំង។ ចំណាំថាប្រសិនបើអ្នកមានថតនិងឯកសារនៅក្នុងថតមេដូចគ្នាថតនឹងត្រូវបានបង្ហាញជាលើកដំបូងតែងតែអមដោយឯកសារ។</p>

<h6>ផ្ទុកឯកសារឡើង</h6>
<p>បន្ទាប់ពីចុចកណ្ដុរស្ដាំលើថតដែលចង់បានបង្អួចផ្ទុកឡើងមួយនឹងបង្ហាញឡើង។
អ្នកអាចបន្ថែមឯកសារដោយទម្លាក់ពួកគេនៅក្នុងប្រអប់ឯកសារផ្ទុកឡើងឬដោយចុចនៅក្នុងប្រអប់ហើយជ្រើសឯកសារពីប្រអប់ឯកសារស្ដង់ដាររបស់អ្នក។
អ្នកអាចជ្រើសឯកសារជាច្រើនដោយសង្កត់បញ្ជា / ពាក្យបញ្ជារបស់អ្នកឬប្ដូរគ្រាប់ចុចខណៈពេលចុចពួកគេ។ ឯកសារដែលបានជ្រើសនឹងបង្ហាញនៅក្នុងបញ្ជីមួយនៅផ្នែកខាងក្រោមនៃអេក្រង់។
បន្ទាប់មកអ្នកអាចលុបឯកសារដែលមិនចាំបាច់ទាំងពីបញ្ជីឬប្រសិនបើចុចផ្ទុកឡើងពេញចិត្តក្នុងការចាប់ផ្តើមដំណើរការផ្ទុកឡើង។</p>
<p>ប្រសិនបើអ្នកទទួលបានការព្រមានអំពីឯកសារដែលមានទំហំធំពេកដែលត្រូវបានណែនាំថាម៉ាស៊ីនជាច្រើនមិនអនុញ្ញាតឱ្យផ្ទុកឡើងឯកសារនៅលើ 2MB ។
កាមេរ៉ាទំនើបជាច្រើននៅក្នុងការផលិតរូបភាព exess នៃ 5MB ដូច្នេះវាជារឿងធម្មតាណាស់ក្នុងការរត់ចូលទៅក្នុងបញ្ហានេះ។
ដើម្បីដោះស្រាយការកំណត់នេះអ្នកអាចស្នើសុំម៉ាស៊ីនរបស់អ្នកដើម្បីផ្លាស់ប្តូរការកំណត់ការផ្ទុកឡើងឬអ្នកអាចផ្លាស់ប្តូរទំហំរូបភាពមានបំណងរបស់អ្នកមុនពេលផ្ទុកឡើង។
ផ្លាស់ប្តូរទំហំមានអត្ថប្រយោជន៍បន្ថែមទៀតនៃការផ្ទុកឡើងដងលឿនជាងមុន។អ្នកអាចផ្លាស់ប្តូរការកំណត់ការផ្ទុកឡើងនៅក្នុង
CP > Files > Settings ផងដែរ ប៉ុន្តែវាជារឿងបន្ទាប់បន្សំសំរាប់ការកំនត់របស់ហោះ។ ឧទាហរណ៍ប្រសិនបើម៉ាស៊ីនអនុញ្ញាតឱ្យផ្ទុកឡើង 50MB មួយអ្នកនៅតែអាចកំណត់ទំហំ
នៃការផ្ទុកឡើងដោយកំណត់អតិបរមានៃមួយ \"20\" (ឧទាហរណ៍) in CP > Files > Settings.</p>

<h6>ធ្វើសមកាលកម្មឯកសារ</h6>
<p>ប្រសិនបើអ្នកត្រូវបានរក្សាទុកឯកសារដែលមានផ្តល់សេវាពពកអ្នកប្រហែលជាចង់ប្រើមុខងារធ្វើសមកាលកម្ម។ នេះអនុញ្ញាតឱ្យអ្នក \"ធ្វើឱ្យស្រស់\"
មូលដ្ឋានទិន្នន័យឯកសាររបស់អ្នកដើម្បីរក្សាវាឱ្យទាន់សម័យជាមួយនឹងទីតាំងផ្ទុកពីចម្ងាយ។ </p>

<h6>ស្វែងរក</h6>
<p>អ្នកអាចស្វែងរកទាំងអស់នៃឯកសារនិងថតរបស់អ្នកដោយវាយពាក្យស្វែងរកមួយនៅក្នុងជួរឈរខាងស្តាំហើយបន្ទាប់មកគ្រាន់តែចុច Key Enter។</p>";