<?php defined('BASEPATH') or exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h4>ទិដ្ឋភាពទូទៅ</h4>
<p>ម៉ូឌុលទំព័រគឺជាវិធីសាមញ្ញតែមានអនុភាពដើម្បីគ្រប់គ្រងមាតិកាឋិតិវន្តនៅលើវែបសាយត៍របស់អ្នក។
ប្រភេទទំព័រអាចត្រូវបានគ្រប់គ្រងនិងធាតុក្រាហ្វិកដែលបានបង្កប់ដោយមិនកែសម្រួលឯកសារពុម្ព។</p>

<h4>គ្រប់គ្រងទំព័រ</h4><hr>
<h6>មាតិកាទំព័រ</h6>
<p>ពេលជ្រើសចំណងជើងទំព័ររបស់អ្នកចងចាំថាប្លង់ទំព័រលំនាំដើមនឹងបង្ហាញចំណងជើងទំព័រខាងលើមាតិកាទំព័រ។
ឥឡូវនេះបង្កើតមាតិកាទំព័ររបស់អ្នកដោយប្រើកម្មវិធីនិពន្ធ WYSIWYG ។
ពេលដែលអ្នកត្រៀមខ្លួនជាស្រេចសម្រាប់ទំព័រនេះត្រូវបានមើលឃើញក្នុងការកំណត់ របស់អ្នកទស្សនាកំណត់ស្ថានភាពរស់។ វានឹងអាចចូលដំណើរការនៅURLបានបង្ហាញ។
អ្នកក៏ត្រូវតែចូលទៅកាន់រចនា ->ការរុករកនិងការបង្កើតតំណរុករកថ្មីមួយប្រសិនបើអ្នកចង់ទំព័ររបស់អ្នកទៅ
បង្ហាញឡើងនៅក្នុងម៉ឺនុយឬជ្រើសតំបន់រុករកពីទម្លាក់ចុះប្រសិនបើអ្នកចង់បានវាបានបង្កើតដោយស្វ័យប្រវត្តិ។</p>

<h6>ទិន្នន័យមេតា</h6>
<p>ចំណងជើងមេតាជាទូទៅត្រូវបានគេប្រើជាចំណងជើងនៅក្នុងលទ្ធផលស្វែងរកនិងត្រូវបានគេជឿថាដើម្បីអនុវត្តទំងន់យ៉ាងសំខាន់ក្នុង ចំណាត់ថ្នាក់ទំព័រ។<br />
ពាក្យគន្លឹះមេតាគឺជាពាក្យដែលពិពណ៌នាអំពីមាតិការបស់តំបន់បណ្ដាញរបស់អ្នកនិងសំរាប់ជាប្រយោជន៍ដល់ម៉ាស៊ីនស្វែងរកប៉ុណ្ណោះ។<br />
សេចក្ដីពណ៌នាមេតាគឺជាសេចក្ដីពណ៌នាខ្លីនៃទំព័រនេះនិងអាចត្រូវបានប្រើជា snippet ស្វែងរកប្រសិនបើម៉ាស៊ីនស្វែងរកយល់ថាជាពាក់ព័ន្ធទៅនឹងការស្វែងរក។</p>

<h6>ការរចនា</h6>
<p>ផ្ទាំងរចនាអនុញ្ញាតឱ្យអ្នកជ្រើសប្លង់ទំព័រផ្ទាល់ខ្លួននិងជម្រើសអនុវត្តរចនាប័ទ្ម CSS ផ្សេងទៅឱ្យវានៅលើទំព័រនេះតែប៉ុណ្ណោះ។
យោងទៅផ្នែកប្រភេទទំព័រខាងក្រោមសម្រាប់សេចក្ដីណែនាំអំពីរបៀបប្រើប្រាស់ប្រភេទល្អបំផុតទំព័រ។</p>

<h6>ស្គ្រីប</h6>
<p>អ្នកអាចដាក់ JavaScript នៅទីនេះដែលអ្នកចង់បន្ថែមទៅ <head> នៃទំព័រនេះ។</p>

<h6>ជម្រើស</h6>
<p>អនុញ្ញាតឱ្យអ្នកបើកយោបល់និងមតិព័ត៌មាន RSS សម្រាប់ទំព័រនេះ។អ្នកក៏អាចដាក់កម្រិតទំព័រមួយទៅក្នុងក្រុមជាក់លាក់ចូលរបស់អ្នកប្រើបានដោយការកំណត់ការចូលដំណើរការវាលនេះ។
បើមតិព័ត៌មាន RSS ដែលត្រូវបានអនុញ្ញាតអ្នកទស្សនាអាចជាវទំព័រនេះហើយពួកគេនឹងទទួលបានទំព័រកូនគ្នានៅក្នុងកម្មវិធីអាន RSS របស់ពួកគេ។</p>
<pre><code>{{ streams:cycle stream={url:segments segment=&quot;2&quot;} }}
    {{ entries }}
        {{ company_intro }}
        {{ owner_name }}
        {{ owner_phone }}
    {{ /entries }}
{{ /streams:cycle }}</code></pre></p>

<h4>ប្រភេទទំព័រ</h4><hr>
<p>ប្រភេទទំព័រអនុញ្ញាតឱ្យអ្នកត្រួតពិនិត្យប្លង់នៃទំព័រនេះដោយគ្មានការកែប្រែឯកសារ។ អ្នកក៏អាចជ្រើសឯកសារប្លង់នៅពេលបង្កើតប្រភេទទំព័រ។
អ្នកអាចបង្កប់ចូលទៅក្នុងស្លាកប្លង់ទំព័រជំនួសឱ្យការដាក់ពួកវានៅគ្រប់ទំព័រ។
ឧទាហរណ៏: ប្រសិនបើអ្នកមានធាតុក្រាហ្វិកមតិព័ត៌មាន Twitter មួយដែលអ្នកចង់បង្ហាញនៅផ្នែកខាងក្រោមនៃគ្រប់ទំព័រដែលអ្នកគ្រាន់តែអាចដាក់ស្លាកធាតុក្រាហ្វិកនៅក្នុងប្លង់ទំព័រ:</p><br />
<pre><code>
{{ page:title }}
{{ page:body }}

&lt;div class=&quot;my-twitter-widget&quot;&gt;
	{{ widgets:instance id=&quot;1&quot; }}
&lt;/div&gt;
</code></pre>
<p>ឥឡូវនេះអ្នកអាចអនុវត្តរចនាប័ទ្ម CSS ទៅ &quot;ខ្ញុំ-Twitter ធាតុក្រាហ្វិក&quot; ថ្នាក់នៅក្នុងផ្ទាំង CSS។</p>";