<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "<h4>کلیات</h4>
<p>شما می توانید با ساتفاده از ماژول متغییر ها، مقادیری را به عنوان متغییر داشته باشید و در کل سایت آنها را مورد استفاده قرار دهید.</p>

<h4>اضافه کردن متغییر</h4>
<p>برای استفاده از ماژول ابتدا یک نام کوتاه برای متغییر انتخاب کنید و مقداری را به آن نسبت بدهیدو آن را ذخیره کنید. سپس می توانید در هرکجای سایت ماند بلاگ و صفحات از مقدار آن استفاده کند و آن را با استفاده از تگ ها در صفحه نمایش دهید.</p>"; 