<?php  if (!defined('BASEPATH')) exit('No direct script access allowed');

$lang['step1']	=	'ជំហានទី #1';
$lang['step2']	=	'ជំហានទី #2';
$lang['step3']	=	'ជំហានទី #3';
$lang['step4']	=	'ជំហានទី #4';
$lang['final']	=	'ជំហានទីចុងក្រោយ';

$lang['installer.passwords_match']		= "ពាក្យសម្ងាត់ត្រឹមត្រូវ។";
$lang['installer.passwords_dont_match']	= "ពាក្យសម្ងាត់មិនត្រឹមត្រូវ។";

// labels
$lang['step1_header']			=   'ជំហានទី 1: កំណត់រចនាសម្ព័ន្ធមូលដ្ឋានទិន្នន័យនិងម៉ាស៊ីនមេ';
$lang['step1_intro_text']		=   'PyroCMS ជាការងាយស្រួលណាស់ក្នុងការដំឡើង និងគួរចំណាយតែពីរបីនាទីប៉ណ្ណេាះ ប៉ុន្តែមានសំណួរមួយចំនួនដែលអាចបង្ហាញការយល់ច្រឡំ បើអ្នកមិនមានបច្ចេកទេស។ ប្រសិនបើមាននៅចំណុចណាមួយដែលអ្នកជាប់គាំងសូមសួរអ្នកផ្តល់សេវាបង្ហោះវែបសាយត៍របស់អ្នក​ឬ <a href="http://www.pyrocms.com/contact" target="_blank">ទាក់ទងមកយើង</a> សម្រាប់ការជួយ។';

$lang['db_driver']		=   'កម្មវិធីបញ្ជាមូលដ្ឋានទិន្នន័យ';
$lang['mysql_about']            =   'MySQL គឺជាមូលដ្ឋានប្រភពទិន្នន័យដែលមិនចំណាយប្រាក់ទិញ ត្រូវបានគេប្រើច្រើនបំផុតនៅលើពិភពលោក។ វាជាការលឿន ពេញនិយម និងបានដំឡើងភាគច្រើននៅលើម៉ាស៊ីនវែបសាយត៍។';
$lang['use_mysql']		=   'ប្រើ MySQL';
$lang['pgsql_about']            =   'PostgreSQL គឺជាជម្រើសដ៏ពេញនិយមបើប្រៀបធៀបទៅកម្មវិធី MySQL ។ វាជាញឹកញាប់បន្តិចលឿនប៉ុន្តែត្រូវបានដំឡើងលើម៉ាស៊ីនមេតិចតាមលំនាំដើម។';
$lang['use_pgsql']		=   'ប្រើ PostgreSQL';
$lang['sqlite_about']           =   'SQLite ខាងគឺជាម៉ាស៊ីនដែលផ្អែកលើឯកសារមួយដែលមានទម្ងន់ស្រាល SQL ដែលបានដំឡើងនៅលើម៉ាស៊ីនមេជាច្រើន និងជាផ្នែកមួយនៃកម្មវិធី PHP នៅលើ PHP 5.3 ។';
$lang['use_sqlite']		=   'ប្រើ SQLite';

$lang['not_available']		=   'មិនមាន';

$lang['db_settings']		=   'ការកំណត់';
$lang['db_server']		=   'ឈ្មោះម៉ាស៊ីន';
$lang['db_location']		=   'ទីតាំង';
$lang['db_username']		=	'ឈ្មោះអ្នកប្រើ';
$lang['db_password']		=	'ពាក្យសម្ងាត់';
$lang['db_portnr']		=	'ច្រក';
$lang['db_database']		=	'ឈ្មោះមូលដ្ឋានទិន្នន័យ';
$lang['db_create']		=	'បង្កើតមូលដ្ឋានទិន្នន័យ';
$lang['db_notice']		=	'អ្នកប្រហែលជាចាំបាច់ត្រូវធ្វើការនេះដោយខ្លួនឯង';

$lang['server_settings']	=	'ការកំណត់ម៉ាស៊ីនមេ';
$lang['httpserver']		=	'ម៉ាស៊ីនបម្រើ HTTP';

$lang['httpserver_text']	=	'PyroCMS តម្រូវឱ្យម៉ាស៊ីនមេ HTTP មួយដើម្បីបង្ហាញថាមវន្តមាតិកានៅពេលមានអ្នកប្រើមួយចូលទៅវែបសាយរបស់អ្នក។ វាមើលទៅដូចជាអ្នកមានមួយដោយការពិតដែលថាអ្នកអាចមើលទំព័រនេះរួចទៅហើយ ប៉ុន្តែប្រសិនបើយើងដឹងច្បាស់ពីប្រភេទបន្ទាប់មក PyroCMS អាចកំណត់រចនាសម្ព័ន្ធដោយខ្លួនឯងប្រសើរជាងមុន។ ប្រសិនបើអ្នកមិនដឹងថាអ្វីដែលមានន័យណាមួយនេះគ្រាន់តែមិនអើពើវានិងអនុវត្តលើការដំឡើង។';
$lang['rewrite_fail']		=	'អ្នកបានជ្រើស "(Apache with mod_rewrite)" ប៉ុន្តែយើងមិនអាចប្រាប់ប្រសិនបើ mod_rewrite ត្រូវបានបើកលើម៉ាស៊ីនមេរបស់អ្នក។ សួរម៉ាស៊ីនរបស់អ្នកប្រសិនបើ mod_rewrite ត្រូវបានអនុញ្ញាតឬគ្រាន់តែដំឡើងនៅក្នុងការប្រថុយប្រថានផ្ទាល់របស់អ្នក។';
$lang['mod_rewrite']		=	'អ្នកបានជ្រើស "(Apache with mod_rewrite)" ប៉ុន្តែម៉ាស៊ីនមេរបស់អ្នកមិនមានម៉ូឌុលដែលបានសរសេរឡើងវិញបានអនុញ្ញាត។ សួរម៉ាស៊ីនរបស់អ្នកដើម្បីអនុញ្ញាតវាឬដំឡើង PyroCMS ដោយប្រើជម្រើស "កម្មវិធី Apache (ដោយគ្មាន mod_rewrite)"។';
$lang['step2']			=	'ជំហានទី 2';

// messages
$lang['db_success']		=	'ការកំណត់មូលដ្ឋានទិន្នន័យត្រូវបានធ្វើតេស្តនិងធ្វើការបាន។';
$lang['db_failure']		=	'បញ្ហាតភ្ជាប់ទៅមូលដ្ឋានទិន្នន័យ: ';

// labels
$lang['step2_header']		=	'ជំហានទី 2: សូមពិនិត្យមើលតម្រូវការ';
$lang['step2_intro_text']	= 	'ជំហានទីពីរនៅក្នុងដំណើរការដំឡើងនេះគឺដើម្បីពិនិត្យមើលថាតើម៉ាស៊ីនមេគាំទ្រ PyroCMS ។ ម៉ាស៊ីនមេភាគច្រើនគួរតែអាចរត់វាដោយមិនមានបញ្ហាណាមួយ។';
$lang['mandatory']		= 	'ជាចាំបាច់';
$lang['recommended']	= 	'ផ្ដល់អនុសាសន៍';

$lang['server_settings']= 	'ការកំណត់ម៉ាស៊ីនមេ HTTP';
$lang['server_version']	=	'ផ្នែកទន់ក្នុងម៉ាស៊ីនមេ:';
$lang['server_fail']	=	'ផ្នែកទន់ក្នុងម៉ាស៊ីនមេមិនត្រូវបានគាំទ្រដូច្នេះ PyroCMS អាចឬមិនដំណើរការ។ ដរាបណាការដំឡើង PHP និង MySQL របស់អ្នកគឺមានរហូតដល់ទៅ PyroCMS កាលបរិច្ឆេទគួរតែអាចដំណើរការបានត្រឹមត្រូវគ្រាន់តែដោយមិនស្អាត  URL\'s បានទេ។';

$lang['php_settings']	=	'ការកំណត់ PHP';
$lang['php_required']	=	'PyroCMS តម្រូវឱ្យកម្មវិធី PHP កំណែ %s ឬខ្ពស់ជាងនេះ។';
$lang['php_version']	=	'ក្នុងម៉ាស៊ីនមេបច្ចុប្បន្នកំពុងរត់កំណែ';
$lang['php_fail']		=	'កំណែ PHP របស់អ្នកត្រូវបានមិនត្រូវបានគាំទ្រ។ PyroCMS តម្រូវឱ្យកម្មវិធី PHP កំណែ %s ឬខ្ពស់ជាងនេះដើម្បីរត់ឱ្យបានត្រឹមត្រូវ។';

$lang['mysql_settings']	=	'ការកំណត់ MySQL';
$lang['mysql_required']	=	'PyroCMS តម្រូវឱ្យចូលដំណើរការទៅកាន់កម្មវិធី MySQL មួយមូលដ្ឋានទិន្នន័យកំពុងរត់កំណែ 5.0 ឬខ្ពស់ជាងនេះ។';
$lang['mysql_version1']	=	'ក្នុងម៉ាស៊ីនមេបច្ចុប្បន្នកំពុងរត់';
$lang['mysql_version2']	=	'ម៉ាស៊ីនភ្ញៀវរបស់អ្នកបច្ចុប្បន្នកំពុងរត់';
$lang['mysql_fail']		=	'កំណែ MySQL របស់អ្នកមិនត្រូវបានគាំទ្រ។ PyroCMS តម្រូវឱ្យកម្មវិធី MySQL កំណែ 5.0 ឬខ្ពស់ជាងនេះដើម្បីរត់ឱ្យបានត្រឹមត្រូវ។';

$lang['gd_settings']	=	'ការកំណត់ GD';
$lang['gd_required']	= 	'PyroCMS តម្រូវឱ្យមានបណ្ណាល័យ GD 1.0 ឬខ្ពស់ជាងនេះដើម្បីរៀបចំរូបភាព។';
$lang['gd_version']		= 	'ក្នុងម៉ាស៊ីនមេបច្ចុប្បន្នកំពុងរត់កំណែ';
$lang['gd_fail']		=	'យើងមិនអាចកំណត់កំណែនៃបណ្ណាល័យ GD បាន។ នេះជាធម្មតាមានន័យថាបណ្ណាល័យ GD មិនត្រូវបានដំឡើង។ PyroCMS នឹងនៅតែរត់ឱ្យបានត្រឹមត្រូវទេប៉ុន្តែមួយចំនួននៃមុខងាររូបភាពប្រហែលជាមិនធ្វើការ។ វាត្រូវបានផ្ដល់អនុសាសន៍យ៉ាងខ្លាំងដើម្បីបើកបណ្ណាល័យ GD ឡើយ។';

$lang['summary']		=	'សេចក្តីសង្ខេប';

$lang['zlib']			=	'Zlib';
$lang['zlib_required']	= 	'PyroCMS តម្រូវឱ្យ Zlib ដើម្បីពន្លានិងដំឡើង themes។';
$lang['zlib_fail']		=	'Zlib មិនអាចត្រូវបានរកឃើញ។ នេះជាធម្មតាមានន័យថា Zlib មិនត្រូវបានដំឡើង។ PyroCMS នឹងនៅតែរត់ឱ្យបានត្រឹមត្រូវទេប៉ុន្តែការដំឡើង themes នឹងមិនធ្វើការ។ វាត្រូវបានផ្ដល់អនុសាសន៍យ៉ាងខ្លាំងឱ្យដំឡើង Zlib ។';

$lang['curl']			=	'Curl';
$lang['curl_required']	=	'PyroCMS តម្រូវឱ្យ cURL ក្នុងគោលបំណងដើម្បីធ្វើឱ្យការតភ្ជាប់ទៅកាន់តំបន់បណ្ដាញផ្សេងទៀត។';
$lang['curl_fail']		=	'cURL មិនអាចត្រូវបានរកឃើញ។ នេះជាធម្មតាមានន័យថា cURL មិនត្រូវបានដំឡើង។ PyroCMS នឹងនៅតែរត់ឱ្យបានត្រឹមត្រូវទេប៉ុន្តែមួយចំនួននៃមុខងារអាចនឹងមិនដំណើរការឡើយ។ វាត្រូវបានផ្ដល់អនុសាសន៍យ៉ាងខ្លាំងដើម្បីបើកបណ្ណាល័យ cURL ។';

$lang['summary_success']	=	'ម៉ាស៊ីនមេជួបតម្រូវការទាំងអស់សម្រាប់ PyroCMS ដើម្បីរត់ឱ្យបានត្រឹមត្រូវទៅកាន់ជំហានបន្ទាប់ដោយចុចប៊ូតុងខាងក្រោម។';
$lang['summary_partial']	=	'ម៉ាស៊ីនមេជួប <em> ច្រើនបំផុត </ em> នៃតម្រូវការសម្រាប់ PyroCMS ។ នេះមានន័យថា PyroCMS គួរតែអាចដំណើរការបានត្រឹមត្រូវទេប៉ុន្តែវាមានឱកាសដែលអ្នកនឹងជួបប្រទះបញ្ហាជាមួយនឹងអ្វីដែលដូចជាការផ្លាស់ប្តូរទំហំរូបភាពនិងបង្កើតរូបភាពតូចមួយ។';
$lang['summary_failure']	=	'វាហាក់ដូចជាថាម៉ាស៊ីនមេបានបរាជ័យក្នុងការបំពេញតាមតម្រូវការដើម្បីរត់ PyroCMS ។ សូមទាក់ទងអ្នកគ្រប់គ្រងម៉ាស៊ីនមេរបស់អ្នកឬក្រុមហ៊ុនបង្ហោះនេះដើម្បីទទួលបានដោះស្រាយ។';
$lang['next_step']		=	'បន្តទៅជំហានបន្ទាប់';
$lang['step3']			=	'ជំហានទី 3';
$lang['retry']			=	'សូមព្យាយាមម្តងទៀត';

// messages
$lang['step1_failure']	=	'សូមបំពេញនៅក្នុងការកំណត់មូលដ្ឋានទិន្នន័យដែលបានទាមទារនៅក្នុងសំណុំបែបបទខាងក្រោម ..';

// labels
$lang['step3_header']			=	'ជំហានទី 3: កំណត់សិទ្ធិ';
$lang['step3_intro_text']		= 	'មុនពេល PyroCMS អាចត្រូវបានដំឡើងអ្នកត្រូវការដើម្បីធ្វើឱ្យប្រាកដថាឯកសារមួយចំនួននិងថតគឺសរសេរឯកសារនិងថតទាំងនេះត្រូវបានរាយខាងក្រោម។ សូមប្រាកដថាថតរងណាមួយមានសិទ្ធិត្រឹមត្រូវផងដែរ!';

$lang['folder_perm']		= 'សិទ្ធិថត';
$lang['folder_text']		= 'តម្លៃ chmod ថតដូចខាងក្រោមនេះត្រូវតែត្រូវបានផ្លាស់ប្តូរទៅ 777 (ក្នុងករណីមួយចំនួន 775 ធ្វើការផងដែរ) ។';

$lang['file_perm']		= 'សិទ្ធិឯកសារ';
$lang['file_text']		= 'Tលោកបាន chmod តម្លៃនៃឯកសារដូចខាងក្រោមនេះត្រូវតែត្រូវបានផ្លាស់ប្តូរទៅ 666 ។ វាមានសារៈសំខាន់ខ្លាំងណាស់ក្នុងការផ្លាស់ប្តូរសិទ្ធិរបស់ឯកសាររបស់ <em> ឯកសារកំណត់រចនាសម្ព័ន្ធមុនពេល </ em> មានបន្តការដំឡើង។';

$lang['writable']		= 'អាចសរសេរបាន';
$lang['not_writable']		= 'មិនអាចសរសេរបាន';

$lang['show_commands']		= 'បង្ហាញពាក្យបញ្ជា';
$lang['hide_commands']		= 'លាក់ពាក្យបញ្ជា';

$lang['next_step']		= 'បន្តទៅជំហានបន្ទាប់';
$lang['step4']			= 'ជំហានទី 4';
$lang['retry']			= 'សូមព្យាយាមម្តងទៀត';

// labels
$lang['step4_header']			=	'ជំហានទី 4: បង្កើតមូលដ្ឋានទិន្នន័យ';
$lang['step4_intro_text']		=	'បំពេញសំណុំបែបបទខាងក្រោមហើយចុចប៊ូតុងដែលមានស្លាក "ដំឡើង" ដើម្បីដំឡើង PyroCMS នេះ។ ត្រូវប្រាកដថាដើម្បីដំឡើងចូលទៅក្នុងមូលដ្ឋានទិន្នន័យ PyroCMS សិទ្ធិចាប់តាំងពីការផ្លាស់ប្តូរដែលមានស្រាប់ទាំងអស់នឹងត្រូវបាត់!';

$lang['default_user']		=	'អ្នកប្រើដើម';
$lang['site_settings']		= 	'ការកំណត់វែបសាយ';
$lang['site_ref']		=	'Ref វែបសាយ';
$lang['username']		= 	'ឈ្មោះអ្នកប្រើ';
$lang['firstname']		= 	'ឈ្មោះខ្លួន';
$lang['lastname']		=	'នាមត្រកូល';
$lang['email']			=	'អ៊ីម៉ែល';
$lang['password']		= 	'ពាក្យសម្ងាត់';
$lang['conf_password']		=	'បញ្ជាក់ពាក្យសម្ងាត់';
$lang['finish']			=	'ដំឡើង';

$lang['invalid_db_name'] = 'ឈ្មោះមូលដ្ឋានទិន្នន័យដែលអ្នកបានបញ្ចូលមិនត្រឹមត្រូវ។ សូមប្រើតួអក្សរក្រមលេខប៉ុណ្ណោះនិងសញ្ញាគូសក្រោម។';
$lang['error_101']		=	'មូលដ្ឋានទិន្នន័យមិនអាចរកឃើញ។ ប្រសិនបើអ្នកសួរថាកម្មវិធីដំឡើងបង្កើតមូលដ្ឋានទិន្នន័យនេះវាអាចដោយសារតែបរាជ័យក្នុងការសិទ្ធិអាក្រក់។';
$lang['error_102']		=	'កម្មវិធីដំឡើងមិនអាចបន្ថែមតុណាមួយទៅមូលដ្ឋានទិន្នន័យ។';
$lang['error_103']		=	'កម្មវិធីដំឡើងមិនអាចបញ្ចូលទិន្នន័យទៅក្នុងមូលដ្ឋានទិន្នន័យ។';
$lang['error_104']		=	'កម្មវិធីដំឡើងមិនអាចបង្កើតអ្នកប្រើដំបូង។';
$lang['error_105']		=	'ឯកសារកំណត់រចនាសម្ព័ន្ធមូលដ្ឋានទិន្នន័យមិនអាចត្រូវបានសរសេរតើអ្នកក្លែងបន្លំនៅលើកម្មវិធីដំឡើងដោយរំលងជំហានទី 3?';
$lang['error_106']		=	'ឯកសារកំណត់រចនាសម្ព័ន្ធមិនអាចត្រូវបានសរសេរតើអ្នកប្រាកដថាឯកសារដែលមានសិទ្ធិត្រឹមត្រូវដែរឬទេ?';
$lang['success']		=	'PyroCMS ត្រូវបានដំឡើងដោយជោគជ័យ។';

// labels
$lang['congrats']			= 'សូមអបអរសាទរ';
$lang['intro_text']			= 'ឥឡូវនេះ PyroCMS ត្រូវបានដំឡើងនិងត្រៀមខ្លួនជាស្រេចដើម្បីទៅ! សូមចូលទៅក្នុងបន្ទះគ្រប់គ្រងព័ត៌មានលម្អិតដូចខាងក្រោម។';
$lang['email']				= 'អ៊ីម៉ែល';
$lang['password']			= 'ពាក្យសម្ងាត់';
$lang['show_password']		= 'បង្ហាញពាក្យសំងាត់?';
$lang['outro_text']			= 'ជាចុងក្រោយ <strong> លុបកម្មវិធីដំឡើងពីម៉ាស៊ីនបម្រើរបស់អ្នក </ strong> ដូចជាប្រសិនបើអ្នកទុកវានៅទីនេះវាអាចត្រូវបានប្រើដើម្បី hack វែបសាយរបស់អ្នក។';

$lang['go_website']			= 'ចូលទៅកាន់គេហទំព័រ';
$lang['go_control_panel']	= 'សូមចូលទៅកាន់ផ្ទាំងបញ្ជា';

/* End of file global_lang.php */