<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "<h4>Γενικά</h4>
<p>Το πρόσθετο Μεταβλητές δίνει την δυνατότητα να δημιουργήσετε μεταβλητές που θα αντιστιχούν σε προκαθορισμένες τιμές που θα είναι προσβάσιμες σε όλα τα μέρη του ιστότοπού σας.</p>

<h4>Προσθέτωντας καθολικές μεταβλητές</h4>
<p>Για αν χρησιμοποιήσετε τις μεταβλητές απλώς επιλέξτε ένα σύντομο όνομα (χρησιμοποιήστε λατινικούς χαρακτήρες μόνο) και την αντίστοιχη τιμή που θέλετε να έχει. Στην συνέχεια μπορείτε να ενσωματώσετε το tag που θα παραχθεί στο περιεχόμενο σελίδων, αναρτήσεις ιστολογίων, κτλ και αντί αυτού του tag θα εμφανίζεται η τιμή που έχετε δώσει στην μεταβλητή.</p>";