<?php defined('BASEPATH') OR exit('No direct script access allowed');

// inline help html. Only 'help_body' is used.
$lang['help_body'] = "
<h4>کلیات</h4>
<p>ماژول منوها مسئول ایجاد و کنترل کردن منی های اصلی و فرعی سایت شما است</p>

<h4>گروه منو ها</h4>
<p>
منو ها در گروه خودشان نمایش داده میشوند و هر لینک در منو متعلق به یک گروه خاص است که که در قالب مورد نظر فراخوانی شده است
چنانچه می خواهید یک گروه منو را در قالب خود در محلی نمایش دهید از تگ زیر استفاده کنید
{{ navigation:links group=\"your-group-name\" }}</p>

<h4>اضافه کردن لینک ها </h4>
<p>نامی برای لینک خود انتخاب کنید و موارد زیر را تنظیم کنید:
<ul>
<li>URL: لینک از یک سایت دیگر - http://google.com</li>
<li>لینک سایت: لینکی از سایت خودتان - galleries/portfolio-pictures</li>
<li>ماژول: اشاره به صفحه ایندکس یک ماژول</li>
<li>صفحه: لینک به صفحه </li>
</ul>
</p>
<p></p>

<h4>مرتب کردن لینک ها</h4>
<p>لینک ها در سایت به همان ترتیبی نمایش داده می شوند که در ادمین پنل نمایش داده شده اند. 
برای مرتب کردن ترتیب و چیدمان لینک ها آنها را بکشید و در محل مناسب رها کنید</p>";